Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/spw.h
/* -------- SPW_LINK1_PI_RCS : (SPW Offset: 0x40C) (R/W 32) SpW Link 1 Pending Read, Clear and Enabed Interrupt -------- */
#define SPW_LINK1_PI_RCS_DISERR_Pos           _U_(0)                                               /**< (SPW_LINK1_PI_RCS) DisErr Position */
#define SPW_LINK1_PI_RCS_DISERR_Msk           (_U_(0x1) << SPW_LINK1_PI_RCS_DISERR_Pos)            /**< (SPW_LINK1_PI_RCS) DisErr Mask */
#define SPW_LINK1_PI_RCS_DISERR(value)        (SPW_LINK1_PI_RCS_DISERR_Msk & ((value) << SPW_LINK1_PI_RCS_DISERR_Pos))
#define SPW_LINK1_PI_RCS_PARERR_Pos           _U_(1)                                               /**< (SPW_LINK1_PI_RCS) ParErr Position */
#define SPW_LINK1_PI_RCS_PARERR_Msk           (_U_(0x1) << SPW_LINK1_PI_RCS_PARERR_Pos)            /**< (SPW_LINK1_PI_RCS) ParErr Mask */
#define SPW_LINK1_PI_RCS_PARERR(value)        (SPW_LINK1_PI_RCS_PARERR_Msk & ((value) << SPW_LINK1_PI_RCS_PARERR_Pos))
#define SPW_LINK1_PI_RCS_ESCERR_Pos           _U_(2)                                               /**< (SPW_LINK1_PI_RCS) ESCErr Position */
#define SPW_LINK1_PI_RCS_ESCERR_Msk           (_U_(0x1) << SPW_LINK1_PI_RCS_ESCERR_Pos)            /**< (SPW_LINK1_PI_RCS) ESCErr Mask */
#define SPW_LINK1_PI_RCS_ESCERR(value)        (SPW_LINK1_PI_RCS_ESCERR_Msk & ((value) << SPW_LINK1_PI_RCS_ESCERR_Pos))
#define SPW_LINK1_PI_RCS_CRERR_Pos            _U_(3)                                               /**< (SPW_LINK1_PI_RCS) CrErr Position */
#define SPW_LINK1_PI_RCS_CRERR_Msk            (_U_(0x1) << SPW_LINK1_PI_RCS_CRERR_Pos)             /**< (SPW_LINK1_PI_RCS) CrErr Mask */
#define SPW_LINK1_PI_RCS_CRERR(value)         (SPW_LINK1_PI_RCS_CRERR_Msk & ((value) << SPW_LINK1_PI_RCS_CRERR_Pos))
#define SPW_LINK1_PI_RCS_LINKABORT_Pos        _U_(4)                                               /**< (SPW_LINK1_PI_RCS) LinkAbort Position */
#define SPW_LINK1_PI_RCS_LINKABORT_Msk        (_U_(0x1) << SPW_LINK1_PI_RCS_LINKABORT_Pos)         /**< (SPW_LINK1_PI_RCS) LinkAbort Mask */
#define SPW_LINK1_PI_RCS_LINKABORT(value)     (SPW_LINK1_PI_RCS_LINKABORT_Msk & ((value) << SPW_LINK1_PI_RCS_LINKABORT_Pos))
#define SPW_LINK1_PI_RCS_EEPTRANS_Pos         _U_(5)                                               /**< (SPW_LINK1_PI_RCS) EEP transmitted Position */
#define SPW_LINK1_PI_RCS_EEPTRANS_Msk         (_U_(0x1) << SPW_LINK1_PI_RCS_EEPTRANS_Pos)          /**< (SPW_LINK1_PI_RCS) EEP transmitted Mask */
#define SPW_LINK1_PI_RCS_EEPTRANS(value)      (SPW_LINK1_PI_RCS_EEPTRANS_Msk & ((value) << SPW_LINK1_PI_RCS_EEPTRANS_Pos))
#define SPW_LINK1_PI_RCS_EEPREC_Pos           _U_(6)                                               /**< (SPW_LINK1_PI_RCS) EEP received Position */
#define SPW_LINK1_PI_RCS_EEPREC_Msk           (_U_(0x1) << SPW_LINK1_PI_RCS_EEPREC_Pos)            /**< (SPW_LINK1_PI_RCS) EEP received Mask */
#define SPW_LINK1_PI_RCS_EEPREC(value)        (SPW_LINK1_PI_RCS_EEPREC_Msk & ((value) << SPW_LINK1_PI_RCS_EEPREC_Pos))
#define SPW_LINK1_PI_RCS_DISCARD_Pos          _U_(7)                                               /**< (SPW_LINK1_PI_RCS) Discard Position */
#define SPW_LINK1_PI_RCS_DISCARD_Msk          (_U_(0x1) << SPW_LINK1_PI_RCS_DISCARD_Pos)           /**< (SPW_LINK1_PI_RCS) Discard Mask */
#define SPW_LINK1_PI_RCS_DISCARD(value)       (SPW_LINK1_PI_RCS_DISCARD_Msk & ((value) << SPW_LINK1_PI_RCS_DISCARD_Pos))
#define SPW_LINK1_PI_RCS_ESCEVENT2_Pos        _U_(8)                                               /**< (SPW_LINK1_PI_RCS) Escape Event 2 Position */
#define SPW_LINK1_PI_RCS_ESCEVENT2_Msk        (_U_(0x1) << SPW_LINK1_PI_RCS_ESCEVENT2_Pos)         /**< (SPW_LINK1_PI_RCS) Escape Event 2 Mask */
#define SPW_LINK1_PI_RCS_ESCEVENT2(value)     (SPW_LINK1_PI_RCS_ESCEVENT2_Msk & ((value) << SPW_LINK1_PI_RCS_ESCEVENT2_Pos))
#define SPW_LINK1_PI_RCS_ESCEVENT1_Pos        _U_(9)                                               /**< (SPW_LINK1_PI_RCS) Escape Event 1 Position */
#define SPW_LINK1_PI_RCS_ESCEVENT1_Msk        (_U_(0x1) << SPW_LINK1_PI_RCS_ESCEVENT1_Pos)         /**< (SPW_LINK1_PI_RCS) Escape Event 1 Mask */
#define SPW_LINK1_PI_RCS_ESCEVENT1(value)     (SPW_LINK1_PI_RCS_ESCEVENT1_Msk & ((value) << SPW_LINK1_PI_RCS_ESCEVENT1_Pos))
#define SPW_LINK1_PI_RCS_Msk                  _U_(0x000003FF)                                      /**< (SPW_LINK1_PI_RCS) Register Mask  */

#define SPW_LINK1_PI_RCS_ESCEVENT_Pos         _U_(8)                                               /**< (SPW_LINK1_PI_RCS Position) Escape Event x */
#define SPW_LINK1_PI_RCS_ESCEVENT_Msk         (_U_(0x3) << SPW_LINK1_PI_RCS_ESCEVENT_Pos)          /**< (SPW_LINK1_PI_RCS Mask) ESCEVENT */
#define SPW_LINK1_PI_RCS_ESCEVENT(value)      (SPW_LINK1_PI_RCS_ESCEVENT_Msk & ((value) << SPW_LINK1_PI_RCS_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_IM : (SPW Offset: 0x410) (R/W 32) SpW Link 1 Interrupt Mask -------- */
#define SPW_LINK1_IM_DISERR_Pos               _U_(0)                                               /**< (SPW_LINK1_IM) DisErr Position */
#define SPW_LINK1_IM_DISERR_Msk               (_U_(0x1) << SPW_LINK1_IM_DISERR_Pos)                /**< (SPW_LINK1_IM) DisErr Mask */
#define SPW_LINK1_IM_DISERR(value)            (SPW_LINK1_IM_DISERR_Msk & ((value) << SPW_LINK1_IM_DISERR_Pos))
#define SPW_LINK1_IM_PARERR_Pos               _U_(1)                                               /**< (SPW_LINK1_IM) ParErr Position */
#define SPW_LINK1_IM_PARERR_Msk               (_U_(0x1) << SPW_LINK1_IM_PARERR_Pos)                /**< (SPW_LINK1_IM) ParErr Mask */
#define SPW_LINK1_IM_PARERR(value)            (SPW_LINK1_IM_PARERR_Msk & ((value) << SPW_LINK1_IM_PARERR_Pos))
#define SPW_LINK1_IM_ESCERR_Pos               _U_(2)                                               /**< (SPW_LINK1_IM) ESCErr Position */
#define SPW_LINK1_IM_ESCERR_Msk               (_U_(0x1) << SPW_LINK1_IM_ESCERR_Pos)                /**< (SPW_LINK1_IM) ESCErr Mask */
#define SPW_LINK1_IM_ESCERR(value)            (SPW_LINK1_IM_ESCERR_Msk & ((value) << SPW_LINK1_IM_ESCERR_Pos))
#define SPW_LINK1_IM_CRERR_Pos                _U_(3)                                               /**< (SPW_LINK1_IM) CrErr Position */
#define SPW_LINK1_IM_CRERR_Msk                (_U_(0x1) << SPW_LINK1_IM_CRERR_Pos)                 /**< (SPW_LINK1_IM) CrErr Mask */
#define SPW_LINK1_IM_CRERR(value)             (SPW_LINK1_IM_CRERR_Msk & ((value) << SPW_LINK1_IM_CRERR_Pos))
#define SPW_LINK1_IM_LINKABORT_Pos            _U_(4)                                               /**< (SPW_LINK1_IM) LinkAbort Position */
#define SPW_LINK1_IM_LINKABORT_Msk            (_U_(0x1) << SPW_LINK1_IM_LINKABORT_Pos)             /**< (SPW_LINK1_IM) LinkAbort Mask */
#define SPW_LINK1_IM_LINKABORT(value)         (SPW_LINK1_IM_LINKABORT_Msk & ((value) << SPW_LINK1_IM_LINKABORT_Pos))
#define SPW_LINK1_IM_EEPTRANS_Pos             _U_(5)                                               /**< (SPW_LINK1_IM) EEP transmitted Position */
#define SPW_LINK1_IM_EEPTRANS_Msk             (_U_(0x1) << SPW_LINK1_IM_EEPTRANS_Pos)              /**< (SPW_LINK1_IM) EEP transmitted Mask */
#define SPW_LINK1_IM_EEPTRANS(value)          (SPW_LINK1_IM_EEPTRANS_Msk & ((value) << SPW_LINK1_IM_EEPTRANS_Pos))
#define SPW_LINK1_IM_EEPREC_Pos               _U_(6)                                               /**< (SPW_LINK1_IM) EEP received Position */
#define SPW_LINK1_IM_EEPREC_Msk               (_U_(0x1) << SPW_LINK1_IM_EEPREC_Pos)                /**< (SPW_LINK1_IM) EEP received Mask */
#define SPW_LINK1_IM_EEPREC(value)            (SPW_LINK1_IM_EEPREC_Msk & ((value) << SPW_LINK1_IM_EEPREC_Pos))
#define SPW_LINK1_IM_DISCARD_Pos              _U_(7)                                               /**< (SPW_LINK1_IM) Discard Position */
#define SPW_LINK1_IM_DISCARD_Msk              (_U_(0x1) << SPW_LINK1_IM_DISCARD_Pos)               /**< (SPW_LINK1_IM) Discard Mask */
#define SPW_LINK1_IM_DISCARD(value)           (SPW_LINK1_IM_DISCARD_Msk & ((value) << SPW_LINK1_IM_DISCARD_Pos))
#define SPW_LINK1_IM_ESCEVENT2_Pos            _U_(8)                                               /**< (SPW_LINK1_IM) Escape Event 2 Position */
#define SPW_LINK1_IM_ESCEVENT2_Msk            (_U_(0x1) << SPW_LINK1_IM_ESCEVENT2_Pos)             /**< (SPW_LINK1_IM) Escape Event 2 Mask */
#define SPW_LINK1_IM_ESCEVENT2(value)         (SPW_LINK1_IM_ESCEVENT2_Msk & ((value) << SPW_LINK1_IM_ESCEVENT2_Pos))
#define SPW_LINK1_IM_ESCEVENT1_Pos            _U_(9)                                               /**< (SPW_LINK1_IM) Escape Event 1 Position */
#define SPW_LINK1_IM_ESCEVENT1_Msk            (_U_(0x1) << SPW_LINK1_IM_ESCEVENT1_Pos)             /**< (SPW_LINK1_IM) Escape Event 1 Mask */
#define SPW_LINK1_IM_ESCEVENT1(value)         (SPW_LINK1_IM_ESCEVENT1_Msk & ((value) << SPW_LINK1_IM_ESCEVENT1_Pos))
#define SPW_LINK1_IM_Msk                      _U_(0x000003FF)                                      /**< (SPW_LINK1_IM) Register Mask  */

