Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/spw.h
#define SPW_LINK1_IM_ESCEVENT_Pos             _U_(8)                                               /**< (SPW_LINK1_IM Position) Escape Event x */
#define SPW_LINK1_IM_ESCEVENT_Msk             (_U_(0x3) << SPW_LINK1_IM_ESCEVENT_Pos)              /**< (SPW_LINK1_IM Mask) ESCEVENT */
#define SPW_LINK1_IM_ESCEVENT(value)          (SPW_LINK1_IM_ESCEVENT_Msk & ((value) << SPW_LINK1_IM_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_PI_C : (SPW Offset: 0x414) ( /W 32) SpW Link 1 Clear Pending Interrupt -------- */
#define SPW_LINK1_PI_C_DISERR_Pos             _U_(0)                                               /**< (SPW_LINK1_PI_C) DisErr Position */
#define SPW_LINK1_PI_C_DISERR_Msk             (_U_(0x1) << SPW_LINK1_PI_C_DISERR_Pos)              /**< (SPW_LINK1_PI_C) DisErr Mask */
#define SPW_LINK1_PI_C_DISERR(value)          (SPW_LINK1_PI_C_DISERR_Msk & ((value) << SPW_LINK1_PI_C_DISERR_Pos))
#define SPW_LINK1_PI_C_PARERR_Pos             _U_(1)                                               /**< (SPW_LINK1_PI_C) ParErr Position */
#define SPW_LINK1_PI_C_PARERR_Msk             (_U_(0x1) << SPW_LINK1_PI_C_PARERR_Pos)              /**< (SPW_LINK1_PI_C) ParErr Mask */
#define SPW_LINK1_PI_C_PARERR(value)          (SPW_LINK1_PI_C_PARERR_Msk & ((value) << SPW_LINK1_PI_C_PARERR_Pos))
#define SPW_LINK1_PI_C_ESCERR_Pos             _U_(2)                                               /**< (SPW_LINK1_PI_C) ESCErr Position */
#define SPW_LINK1_PI_C_ESCERR_Msk             (_U_(0x1) << SPW_LINK1_PI_C_ESCERR_Pos)              /**< (SPW_LINK1_PI_C) ESCErr Mask */
#define SPW_LINK1_PI_C_ESCERR(value)          (SPW_LINK1_PI_C_ESCERR_Msk & ((value) << SPW_LINK1_PI_C_ESCERR_Pos))
#define SPW_LINK1_PI_C_CRERR_Pos              _U_(3)                                               /**< (SPW_LINK1_PI_C) CrErr Position */
#define SPW_LINK1_PI_C_CRERR_Msk              (_U_(0x1) << SPW_LINK1_PI_C_CRERR_Pos)               /**< (SPW_LINK1_PI_C) CrErr Mask */
#define SPW_LINK1_PI_C_CRERR(value)           (SPW_LINK1_PI_C_CRERR_Msk & ((value) << SPW_LINK1_PI_C_CRERR_Pos))
#define SPW_LINK1_PI_C_LINKABORT_Pos          _U_(4)                                               /**< (SPW_LINK1_PI_C) LinkAbort Position */
#define SPW_LINK1_PI_C_LINKABORT_Msk          (_U_(0x1) << SPW_LINK1_PI_C_LINKABORT_Pos)           /**< (SPW_LINK1_PI_C) LinkAbort Mask */
#define SPW_LINK1_PI_C_LINKABORT(value)       (SPW_LINK1_PI_C_LINKABORT_Msk & ((value) << SPW_LINK1_PI_C_LINKABORT_Pos))
#define SPW_LINK1_PI_C_EEPTRANS_Pos           _U_(5)                                               /**< (SPW_LINK1_PI_C) EEP transmitted Position */
#define SPW_LINK1_PI_C_EEPTRANS_Msk           (_U_(0x1) << SPW_LINK1_PI_C_EEPTRANS_Pos)            /**< (SPW_LINK1_PI_C) EEP transmitted Mask */
#define SPW_LINK1_PI_C_EEPTRANS(value)        (SPW_LINK1_PI_C_EEPTRANS_Msk & ((value) << SPW_LINK1_PI_C_EEPTRANS_Pos))
#define SPW_LINK1_PI_C_EEPREC_Pos             _U_(6)                                               /**< (SPW_LINK1_PI_C) EEP received Position */
#define SPW_LINK1_PI_C_EEPREC_Msk             (_U_(0x1) << SPW_LINK1_PI_C_EEPREC_Pos)              /**< (SPW_LINK1_PI_C) EEP received Mask */
#define SPW_LINK1_PI_C_EEPREC(value)          (SPW_LINK1_PI_C_EEPREC_Msk & ((value) << SPW_LINK1_PI_C_EEPREC_Pos))
#define SPW_LINK1_PI_C_DISCARD_Pos            _U_(7)                                               /**< (SPW_LINK1_PI_C) Discard Position */
#define SPW_LINK1_PI_C_DISCARD_Msk            (_U_(0x1) << SPW_LINK1_PI_C_DISCARD_Pos)             /**< (SPW_LINK1_PI_C) Discard Mask */
#define SPW_LINK1_PI_C_DISCARD(value)         (SPW_LINK1_PI_C_DISCARD_Msk & ((value) << SPW_LINK1_PI_C_DISCARD_Pos))
#define SPW_LINK1_PI_C_ESCEVENT2_Pos          _U_(8)                                               /**< (SPW_LINK1_PI_C) Escape Event 2 Position */
#define SPW_LINK1_PI_C_ESCEVENT2_Msk          (_U_(0x1) << SPW_LINK1_PI_C_ESCEVENT2_Pos)           /**< (SPW_LINK1_PI_C) Escape Event 2 Mask */
#define SPW_LINK1_PI_C_ESCEVENT2(value)       (SPW_LINK1_PI_C_ESCEVENT2_Msk & ((value) << SPW_LINK1_PI_C_ESCEVENT2_Pos))
#define SPW_LINK1_PI_C_ESCEVENT1_Pos          _U_(9)                                               /**< (SPW_LINK1_PI_C) Escape Event 1 Position */
#define SPW_LINK1_PI_C_ESCEVENT1_Msk          (_U_(0x1) << SPW_LINK1_PI_C_ESCEVENT1_Pos)           /**< (SPW_LINK1_PI_C) Escape Event 1 Mask */
#define SPW_LINK1_PI_C_ESCEVENT1(value)       (SPW_LINK1_PI_C_ESCEVENT1_Msk & ((value) << SPW_LINK1_PI_C_ESCEVENT1_Pos))
#define SPW_LINK1_PI_C_Msk                    _U_(0x000003FF)                                      /**< (SPW_LINK1_PI_C) Register Mask  */

#define SPW_LINK1_PI_C_ESCEVENT_Pos           _U_(8)                                               /**< (SPW_LINK1_PI_C Position) Escape Event x */
#define SPW_LINK1_PI_C_ESCEVENT_Msk           (_U_(0x3) << SPW_LINK1_PI_C_ESCEVENT_Pos)            /**< (SPW_LINK1_PI_C Mask) ESCEVENT */
#define SPW_LINK1_PI_C_ESCEVENT(value)        (SPW_LINK1_PI_C_ESCEVENT_Msk & ((value) << SPW_LINK1_PI_C_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_IM_S : (SPW Offset: 0x418) ( /W 32) SpW Link 1 Interrupt Set Mask -------- */
#define SPW_LINK1_IM_S_DISERR_Pos             _U_(0)                                               /**< (SPW_LINK1_IM_S) DisErr Position */
#define SPW_LINK1_IM_S_DISERR_Msk             (_U_(0x1) << SPW_LINK1_IM_S_DISERR_Pos)              /**< (SPW_LINK1_IM_S) DisErr Mask */
#define SPW_LINK1_IM_S_DISERR(value)          (SPW_LINK1_IM_S_DISERR_Msk & ((value) << SPW_LINK1_IM_S_DISERR_Pos))
#define SPW_LINK1_IM_S_PARERR_Pos             _U_(1)                                               /**< (SPW_LINK1_IM_S) ParErr Position */
#define SPW_LINK1_IM_S_PARERR_Msk             (_U_(0x1) << SPW_LINK1_IM_S_PARERR_Pos)              /**< (SPW_LINK1_IM_S) ParErr Mask */
#define SPW_LINK1_IM_S_PARERR(value)          (SPW_LINK1_IM_S_PARERR_Msk & ((value) << SPW_LINK1_IM_S_PARERR_Pos))
#define SPW_LINK1_IM_S_ESCERR_Pos             _U_(2)                                               /**< (SPW_LINK1_IM_S) ESCErr Position */
#define SPW_LINK1_IM_S_ESCERR_Msk             (_U_(0x1) << SPW_LINK1_IM_S_ESCERR_Pos)              /**< (SPW_LINK1_IM_S) ESCErr Mask */
#define SPW_LINK1_IM_S_ESCERR(value)          (SPW_LINK1_IM_S_ESCERR_Msk & ((value) << SPW_LINK1_IM_S_ESCERR_Pos))
#define SPW_LINK1_IM_S_CRERR_Pos              _U_(3)                                               /**< (SPW_LINK1_IM_S) CrErr Position */
#define SPW_LINK1_IM_S_CRERR_Msk              (_U_(0x1) << SPW_LINK1_IM_S_CRERR_Pos)               /**< (SPW_LINK1_IM_S) CrErr Mask */
#define SPW_LINK1_IM_S_CRERR(value)           (SPW_LINK1_IM_S_CRERR_Msk & ((value) << SPW_LINK1_IM_S_CRERR_Pos))
#define SPW_LINK1_IM_S_LINKABORT_Pos          _U_(4)                                               /**< (SPW_LINK1_IM_S) LinkAbort Position */
#define SPW_LINK1_IM_S_LINKABORT_Msk          (_U_(0x1) << SPW_LINK1_IM_S_LINKABORT_Pos)           /**< (SPW_LINK1_IM_S) LinkAbort Mask */
#define SPW_LINK1_IM_S_LINKABORT(value)       (SPW_LINK1_IM_S_LINKABORT_Msk & ((value) << SPW_LINK1_IM_S_LINKABORT_Pos))
#define SPW_LINK1_IM_S_EEPTRANS_Pos           _U_(5)                                               /**< (SPW_LINK1_IM_S) EEP transmitted Position */
#define SPW_LINK1_IM_S_EEPTRANS_Msk           (_U_(0x1) << SPW_LINK1_IM_S_EEPTRANS_Pos)            /**< (SPW_LINK1_IM_S) EEP transmitted Mask */
#define SPW_LINK1_IM_S_EEPTRANS(value)        (SPW_LINK1_IM_S_EEPTRANS_Msk & ((value) << SPW_LINK1_IM_S_EEPTRANS_Pos))
#define SPW_LINK1_IM_S_EEPREC_Pos             _U_(6)                                               /**< (SPW_LINK1_IM_S) EEP received Position */
#define SPW_LINK1_IM_S_EEPREC_Msk             (_U_(0x1) << SPW_LINK1_IM_S_EEPREC_Pos)              /**< (SPW_LINK1_IM_S) EEP received Mask */
#define SPW_LINK1_IM_S_EEPREC(value)          (SPW_LINK1_IM_S_EEPREC_Msk & ((value) << SPW_LINK1_IM_S_EEPREC_Pos))
#define SPW_LINK1_IM_S_DISCARD_Pos            _U_(7)                                               /**< (SPW_LINK1_IM_S) Discard Position */
#define SPW_LINK1_IM_S_DISCARD_Msk            (_U_(0x1) << SPW_LINK1_IM_S_DISCARD_Pos)             /**< (SPW_LINK1_IM_S) Discard Mask */
#define SPW_LINK1_IM_S_DISCARD(value)         (SPW_LINK1_IM_S_DISCARD_Msk & ((value) << SPW_LINK1_IM_S_DISCARD_Pos))
#define SPW_LINK1_IM_S_ESCEVENT2_Pos          _U_(8)                                               /**< (SPW_LINK1_IM_S) Escape Event 2 Position */
#define SPW_LINK1_IM_S_ESCEVENT2_Msk          (_U_(0x1) << SPW_LINK1_IM_S_ESCEVENT2_Pos)           /**< (SPW_LINK1_IM_S) Escape Event 2 Mask */
#define SPW_LINK1_IM_S_ESCEVENT2(value)       (SPW_LINK1_IM_S_ESCEVENT2_Msk & ((value) << SPW_LINK1_IM_S_ESCEVENT2_Pos))
#define SPW_LINK1_IM_S_ESCEVENT1_Pos          _U_(9)                                               /**< (SPW_LINK1_IM_S) Escape Event 1 Position */
#define SPW_LINK1_IM_S_ESCEVENT1_Msk          (_U_(0x1) << SPW_LINK1_IM_S_ESCEVENT1_Pos)           /**< (SPW_LINK1_IM_S) Escape Event 1 Mask */
#define SPW_LINK1_IM_S_ESCEVENT1(value)       (SPW_LINK1_IM_S_ESCEVENT1_Msk & ((value) << SPW_LINK1_IM_S_ESCEVENT1_Pos))
#define SPW_LINK1_IM_S_Msk                    _U_(0x000003FF)                                      /**< (SPW_LINK1_IM_S) Register Mask  */

