Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/spw.h
/* -------- SPW_PKTRX1_PI_RM : (SPW Offset: 0x800) ( R/ 32) PktRx Pending Read Masked Interrupt -------- */
#define SPW_PKTRX1_PI_RM_DEACT_Pos            _U_(0)                                               /**< (SPW_PKTRX1_PI_RM) Deactivated Position */
#define SPW_PKTRX1_PI_RM_DEACT_Msk            (_U_(0x1) << SPW_PKTRX1_PI_RM_DEACT_Pos)             /**< (SPW_PKTRX1_PI_RM) Deactivated Mask */
#define SPW_PKTRX1_PI_RM_DEACT(value)         (SPW_PKTRX1_PI_RM_DEACT_Msk & ((value) << SPW_PKTRX1_PI_RM_DEACT_Pos))
#define SPW_PKTRX1_PI_RM_EOP_Pos              _U_(1)                                               /**< (SPW_PKTRX1_PI_RM) EOP seen Position */
#define SPW_PKTRX1_PI_RM_EOP_Msk              (_U_(0x1) << SPW_PKTRX1_PI_RM_EOP_Pos)               /**< (SPW_PKTRX1_PI_RM) EOP seen Mask */
#define SPW_PKTRX1_PI_RM_EOP(value)           (SPW_PKTRX1_PI_RM_EOP_Msk & ((value) << SPW_PKTRX1_PI_RM_EOP_Pos))
#define SPW_PKTRX1_PI_RM_EEP_Pos              _U_(2)                                               /**< (SPW_PKTRX1_PI_RM) EEP seen Position */
#define SPW_PKTRX1_PI_RM_EEP_Msk              (_U_(0x1) << SPW_PKTRX1_PI_RM_EEP_Pos)               /**< (SPW_PKTRX1_PI_RM) EEP seen Mask */
#define SPW_PKTRX1_PI_RM_EEP(value)           (SPW_PKTRX1_PI_RM_EEP_Msk & ((value) << SPW_PKTRX1_PI_RM_EEP_Pos))
#define SPW_PKTRX1_PI_RM_DISCARD_Pos          _U_(3)                                               /**< (SPW_PKTRX1_PI_RM) Packet Discard Position */
#define SPW_PKTRX1_PI_RM_DISCARD_Msk          (_U_(0x1) << SPW_PKTRX1_PI_RM_DISCARD_Pos)           /**< (SPW_PKTRX1_PI_RM) Packet Discard Mask */
#define SPW_PKTRX1_PI_RM_DISCARD(value)       (SPW_PKTRX1_PI_RM_DISCARD_Msk & ((value) << SPW_PKTRX1_PI_RM_DISCARD_Pos))
#define SPW_PKTRX1_PI_RM_ACT_Pos              _U_(4)                                               /**< (SPW_PKTRX1_PI_RM) Activated Position */
#define SPW_PKTRX1_PI_RM_ACT_Msk              (_U_(0x1) << SPW_PKTRX1_PI_RM_ACT_Pos)               /**< (SPW_PKTRX1_PI_RM) Activated Mask */
#define SPW_PKTRX1_PI_RM_ACT(value)           (SPW_PKTRX1_PI_RM_ACT_Msk & ((value) << SPW_PKTRX1_PI_RM_ACT_Pos))
#define SPW_PKTRX1_PI_RM_Msk                  _U_(0x0000001F)                                      /**< (SPW_PKTRX1_PI_RM) Register Mask  */


/* -------- SPW_PKTRX1_PI_RCM : (SPW Offset: 0x804) ( R/ 32) PktRx Pending Read and Clear Masked Interrupt -------- */
#define SPW_PKTRX1_PI_RCM_DEACT_Pos           _U_(0)                                               /**< (SPW_PKTRX1_PI_RCM) Deactivated Position */
#define SPW_PKTRX1_PI_RCM_DEACT_Msk           (_U_(0x1) << SPW_PKTRX1_PI_RCM_DEACT_Pos)            /**< (SPW_PKTRX1_PI_RCM) Deactivated Mask */
#define SPW_PKTRX1_PI_RCM_DEACT(value)        (SPW_PKTRX1_PI_RCM_DEACT_Msk & ((value) << SPW_PKTRX1_PI_RCM_DEACT_Pos))
#define SPW_PKTRX1_PI_RCM_EOP_Pos             _U_(1)                                               /**< (SPW_PKTRX1_PI_RCM) EOP seen Position */
#define SPW_PKTRX1_PI_RCM_EOP_Msk             (_U_(0x1) << SPW_PKTRX1_PI_RCM_EOP_Pos)              /**< (SPW_PKTRX1_PI_RCM) EOP seen Mask */
#define SPW_PKTRX1_PI_RCM_EOP(value)          (SPW_PKTRX1_PI_RCM_EOP_Msk & ((value) << SPW_PKTRX1_PI_RCM_EOP_Pos))
#define SPW_PKTRX1_PI_RCM_EEP_Pos             _U_(2)                                               /**< (SPW_PKTRX1_PI_RCM) EEP seen Position */
#define SPW_PKTRX1_PI_RCM_EEP_Msk             (_U_(0x1) << SPW_PKTRX1_PI_RCM_EEP_Pos)              /**< (SPW_PKTRX1_PI_RCM) EEP seen Mask */
#define SPW_PKTRX1_PI_RCM_EEP(value)          (SPW_PKTRX1_PI_RCM_EEP_Msk & ((value) << SPW_PKTRX1_PI_RCM_EEP_Pos))
#define SPW_PKTRX1_PI_RCM_DISCARD_Pos         _U_(3)                                               /**< (SPW_PKTRX1_PI_RCM) Packet Discard Position */
#define SPW_PKTRX1_PI_RCM_DISCARD_Msk         (_U_(0x1) << SPW_PKTRX1_PI_RCM_DISCARD_Pos)          /**< (SPW_PKTRX1_PI_RCM) Packet Discard Mask */
#define SPW_PKTRX1_PI_RCM_DISCARD(value)      (SPW_PKTRX1_PI_RCM_DISCARD_Msk & ((value) << SPW_PKTRX1_PI_RCM_DISCARD_Pos))
#define SPW_PKTRX1_PI_RCM_ACT_Pos             _U_(4)                                               /**< (SPW_PKTRX1_PI_RCM) Activated Position */
#define SPW_PKTRX1_PI_RCM_ACT_Msk             (_U_(0x1) << SPW_PKTRX1_PI_RCM_ACT_Pos)              /**< (SPW_PKTRX1_PI_RCM) Activated Mask */
#define SPW_PKTRX1_PI_RCM_ACT(value)          (SPW_PKTRX1_PI_RCM_ACT_Msk & ((value) << SPW_PKTRX1_PI_RCM_ACT_Pos))
#define SPW_PKTRX1_PI_RCM_Msk                 _U_(0x0000001F)                                      /**< (SPW_PKTRX1_PI_RCM) Register Mask  */


/* -------- SPW_PKTRX1_PI_R : (SPW Offset: 0x808) ( R/ 32) PktRx Pending Read Interrupt -------- */
#define SPW_PKTRX1_PI_R_DEACT_Pos             _U_(0)                                               /**< (SPW_PKTRX1_PI_R) Deactivated Position */
#define SPW_PKTRX1_PI_R_DEACT_Msk             (_U_(0x1) << SPW_PKTRX1_PI_R_DEACT_Pos)              /**< (SPW_PKTRX1_PI_R) Deactivated Mask */
#define SPW_PKTRX1_PI_R_DEACT(value)          (SPW_PKTRX1_PI_R_DEACT_Msk & ((value) << SPW_PKTRX1_PI_R_DEACT_Pos))
#define SPW_PKTRX1_PI_R_EOP_Pos               _U_(1)                                               /**< (SPW_PKTRX1_PI_R) EOP seen Position */
#define SPW_PKTRX1_PI_R_EOP_Msk               (_U_(0x1) << SPW_PKTRX1_PI_R_EOP_Pos)                /**< (SPW_PKTRX1_PI_R) EOP seen Mask */
#define SPW_PKTRX1_PI_R_EOP(value)            (SPW_PKTRX1_PI_R_EOP_Msk & ((value) << SPW_PKTRX1_PI_R_EOP_Pos))
#define SPW_PKTRX1_PI_R_EEP_Pos               _U_(2)                                               /**< (SPW_PKTRX1_PI_R) EEP seen Position */
#define SPW_PKTRX1_PI_R_EEP_Msk               (_U_(0x1) << SPW_PKTRX1_PI_R_EEP_Pos)                /**< (SPW_PKTRX1_PI_R) EEP seen Mask */
#define SPW_PKTRX1_PI_R_EEP(value)            (SPW_PKTRX1_PI_R_EEP_Msk & ((value) << SPW_PKTRX1_PI_R_EEP_Pos))
#define SPW_PKTRX1_PI_R_DISCARD_Pos           _U_(3)                                               /**< (SPW_PKTRX1_PI_R) Packet Discard Position */
#define SPW_PKTRX1_PI_R_DISCARD_Msk           (_U_(0x1) << SPW_PKTRX1_PI_R_DISCARD_Pos)            /**< (SPW_PKTRX1_PI_R) Packet Discard Mask */
#define SPW_PKTRX1_PI_R_DISCARD(value)        (SPW_PKTRX1_PI_R_DISCARD_Msk & ((value) << SPW_PKTRX1_PI_R_DISCARD_Pos))
#define SPW_PKTRX1_PI_R_ACT_Pos               _U_(4)                                               /**< (SPW_PKTRX1_PI_R) Activated Position */
#define SPW_PKTRX1_PI_R_ACT_Msk               (_U_(0x1) << SPW_PKTRX1_PI_R_ACT_Pos)                /**< (SPW_PKTRX1_PI_R) Activated Mask */
#define SPW_PKTRX1_PI_R_ACT(value)            (SPW_PKTRX1_PI_R_ACT_Msk & ((value) << SPW_PKTRX1_PI_R_ACT_Pos))
#define SPW_PKTRX1_PI_R_Msk                   _U_(0x0000001F)                                      /**< (SPW_PKTRX1_PI_R) Register Mask  */


/* -------- SPW_PKTRX1_PI_RCS : (SPW Offset: 0x80C) (R/W 32) PktRx Pending Read, Clear and Enabled Interrupt -------- */
#define SPW_PKTRX1_PI_RCS_DEACT_Pos           _U_(0)                                               /**< (SPW_PKTRX1_PI_RCS) Deactivated Position */
#define SPW_PKTRX1_PI_RCS_DEACT_Msk           (_U_(0x1) << SPW_PKTRX1_PI_RCS_DEACT_Pos)            /**< (SPW_PKTRX1_PI_RCS) Deactivated Mask */
#define SPW_PKTRX1_PI_RCS_DEACT(value)        (SPW_PKTRX1_PI_RCS_DEACT_Msk & ((value) << SPW_PKTRX1_PI_RCS_DEACT_Pos))
#define SPW_PKTRX1_PI_RCS_EOP_Pos             _U_(1)                                               /**< (SPW_PKTRX1_PI_RCS) EOP seen Position */
#define SPW_PKTRX1_PI_RCS_EOP_Msk             (_U_(0x1) << SPW_PKTRX1_PI_RCS_EOP_Pos)              /**< (SPW_PKTRX1_PI_RCS) EOP seen Mask */
#define SPW_PKTRX1_PI_RCS_EOP(value)          (SPW_PKTRX1_PI_RCS_EOP_Msk & ((value) << SPW_PKTRX1_PI_RCS_EOP_Pos))
#define SPW_PKTRX1_PI_RCS_EEP_Pos             _U_(2)                                               /**< (SPW_PKTRX1_PI_RCS) EEP seen Position */
#define SPW_PKTRX1_PI_RCS_EEP_Msk             (_U_(0x1) << SPW_PKTRX1_PI_RCS_EEP_Pos)              /**< (SPW_PKTRX1_PI_RCS) EEP seen Mask */
#define SPW_PKTRX1_PI_RCS_EEP(value)          (SPW_PKTRX1_PI_RCS_EEP_Msk & ((value) << SPW_PKTRX1_PI_RCS_EEP_Pos))
#define SPW_PKTRX1_PI_RCS_DISCARD_Pos         _U_(3)                                               /**< (SPW_PKTRX1_PI_RCS) Packet Discard Position */
#define SPW_PKTRX1_PI_RCS_DISCARD_Msk         (_U_(0x1) << SPW_PKTRX1_PI_RCS_DISCARD_Pos)          /**< (SPW_PKTRX1_PI_RCS) Packet Discard Mask */
#define SPW_PKTRX1_PI_RCS_DISCARD(value)      (SPW_PKTRX1_PI_RCS_DISCARD_Msk & ((value) << SPW_PKTRX1_PI_RCS_DISCARD_Pos))
#define SPW_PKTRX1_PI_RCS_ACT_Pos             _U_(4)                                               /**< (SPW_PKTRX1_PI_RCS) Activated Position */
#define SPW_PKTRX1_PI_RCS_ACT_Msk             (_U_(0x1) << SPW_PKTRX1_PI_RCS_ACT_Pos)              /**< (SPW_PKTRX1_PI_RCS) Activated Mask */
#define SPW_PKTRX1_PI_RCS_ACT(value)          (SPW_PKTRX1_PI_RCS_ACT_Msk & ((value) << SPW_PKTRX1_PI_RCS_ACT_Pos))
#define SPW_PKTRX1_PI_RCS_Msk                 _U_(0x0000001F)                                      /**< (SPW_PKTRX1_PI_RCS) Register Mask  */


/* -------- SPW_PKTRX1_IM : (SPW Offset: 0x810) (R/W 32) PktRx Interrupt Mask -------- */
#define SPW_PKTRX1_IM_DEACT_Pos               _U_(0)                                               /**< (SPW_PKTRX1_IM) Deactivated Position */
#define SPW_PKTRX1_IM_DEACT_Msk               (_U_(0x1) << SPW_PKTRX1_IM_DEACT_Pos)                /**< (SPW_PKTRX1_IM) Deactivated Mask */
#define SPW_PKTRX1_IM_DEACT(value)            (SPW_PKTRX1_IM_DEACT_Msk & ((value) << SPW_PKTRX1_IM_DEACT_Pos))
#define SPW_PKTRX1_IM_EOP_Pos                 _U_(1)                                               /**< (SPW_PKTRX1_IM) EOP seen Position */
#define SPW_PKTRX1_IM_EOP_Msk                 (_U_(0x1) << SPW_PKTRX1_IM_EOP_Pos)                  /**< (SPW_PKTRX1_IM) EOP seen Mask */
#define SPW_PKTRX1_IM_EOP(value)              (SPW_PKTRX1_IM_EOP_Msk & ((value) << SPW_PKTRX1_IM_EOP_Pos))
#define SPW_PKTRX1_IM_EEP_Pos                 _U_(2)                                               /**< (SPW_PKTRX1_IM) EEP seen Position */
#define SPW_PKTRX1_IM_EEP_Msk                 (_U_(0x1) << SPW_PKTRX1_IM_EEP_Pos)                  /**< (SPW_PKTRX1_IM) EEP seen Mask */
#define SPW_PKTRX1_IM_EEP(value)              (SPW_PKTRX1_IM_EEP_Msk & ((value) << SPW_PKTRX1_IM_EEP_Pos))
#define SPW_PKTRX1_IM_DISCARD_Pos             _U_(3)                                               /**< (SPW_PKTRX1_IM) Packet Discard Position */
#define SPW_PKTRX1_IM_DISCARD_Msk             (_U_(0x1) << SPW_PKTRX1_IM_DISCARD_Pos)              /**< (SPW_PKTRX1_IM) Packet Discard Mask */
#define SPW_PKTRX1_IM_DISCARD(value)          (SPW_PKTRX1_IM_DISCARD_Msk & ((value) << SPW_PKTRX1_IM_DISCARD_Pos))
#define SPW_PKTRX1_IM_ACT_Pos                 _U_(4)                                               /**< (SPW_PKTRX1_IM) Activated Position */
#define SPW_PKTRX1_IM_ACT_Msk                 (_U_(0x1) << SPW_PKTRX1_IM_ACT_Pos)                  /**< (SPW_PKTRX1_IM) Activated Mask */
#define SPW_PKTRX1_IM_ACT(value)              (SPW_PKTRX1_IM_ACT_Msk & ((value) << SPW_PKTRX1_IM_ACT_Pos))
#define SPW_PKTRX1_IM_Msk                     _U_(0x0000001F)                                      /**< (SPW_PKTRX1_IM) Register Mask  */


