Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/spw.h
/* -------- SPW_PKTRX1_PREVBUFSTS : (SPW Offset: 0x854) ( R/ 32) PktRx Previous Buffer Status -------- */
#define SPW_PKTRX1_PREVBUFSTS_CNT_Pos         _U_(0)                                               /**< (SPW_PKTRX1_PREVBUFSTS) Count Position */
#define SPW_PKTRX1_PREVBUFSTS_CNT_Msk         (_U_(0xFFFF) << SPW_PKTRX1_PREVBUFSTS_CNT_Pos)       /**< (SPW_PKTRX1_PREVBUFSTS) Count Mask */
#define SPW_PKTRX1_PREVBUFSTS_CNT(value)      (SPW_PKTRX1_PREVBUFSTS_CNT_Msk & ((value) << SPW_PKTRX1_PREVBUFSTS_CNT_Pos))
#define SPW_PKTRX1_PREVBUFSTS_EEP_Pos         _U_(16)                                              /**< (SPW_PKTRX1_PREVBUFSTS) EEP seen Position */
#define SPW_PKTRX1_PREVBUFSTS_EEP_Msk         (_U_(0x1) << SPW_PKTRX1_PREVBUFSTS_EEP_Pos)          /**< (SPW_PKTRX1_PREVBUFSTS) EEP seen Mask */
#define SPW_PKTRX1_PREVBUFSTS_EEP(value)      (SPW_PKTRX1_PREVBUFSTS_EEP_Msk & ((value) << SPW_PKTRX1_PREVBUFSTS_EEP_Pos))
#define SPW_PKTRX1_PREVBUFSTS_FULLI_Pos       _U_(17)                                              /**< (SPW_PKTRX1_PREVBUFSTS) Buffer Info Full Position */
#define SPW_PKTRX1_PREVBUFSTS_FULLI_Msk       (_U_(0x1) << SPW_PKTRX1_PREVBUFSTS_FULLI_Pos)        /**< (SPW_PKTRX1_PREVBUFSTS) Buffer Info Full Mask */
#define SPW_PKTRX1_PREVBUFSTS_FULLI(value)    (SPW_PKTRX1_PREVBUFSTS_FULLI_Msk & ((value) << SPW_PKTRX1_PREVBUFSTS_FULLI_Pos))
#define SPW_PKTRX1_PREVBUFSTS_FULLD_Pos       _U_(18)                                              /**< (SPW_PKTRX1_PREVBUFSTS) Buffer Data Full Position */
#define SPW_PKTRX1_PREVBUFSTS_FULLD_Msk       (_U_(0x1) << SPW_PKTRX1_PREVBUFSTS_FULLD_Pos)        /**< (SPW_PKTRX1_PREVBUFSTS) Buffer Data Full Mask */
#define SPW_PKTRX1_PREVBUFSTS_FULLD(value)    (SPW_PKTRX1_PREVBUFSTS_FULLD_Msk & ((value) << SPW_PKTRX1_PREVBUFSTS_FULLD_Pos))
#define SPW_PKTRX1_PREVBUFSTS_DMAERR_Pos      _U_(19)                                              /**< (SPW_PKTRX1_PREVBUFSTS) DMA Error Position */
#define SPW_PKTRX1_PREVBUFSTS_DMAERR_Msk      (_U_(0x1) << SPW_PKTRX1_PREVBUFSTS_DMAERR_Pos)       /**< (SPW_PKTRX1_PREVBUFSTS) DMA Error Mask */
#define SPW_PKTRX1_PREVBUFSTS_DMAERR(value)   (SPW_PKTRX1_PREVBUFSTS_DMAERR_Msk & ((value) << SPW_PKTRX1_PREVBUFSTS_DMAERR_Pos))
#define SPW_PKTRX1_PREVBUFSTS_LOCKED_Pos      _U_(31)                                              /**< (SPW_PKTRX1_PREVBUFSTS) Locked Position */
#define SPW_PKTRX1_PREVBUFSTS_LOCKED_Msk      (_U_(0x1) << SPW_PKTRX1_PREVBUFSTS_LOCKED_Pos)       /**< (SPW_PKTRX1_PREVBUFSTS) Locked Mask */
#define SPW_PKTRX1_PREVBUFSTS_LOCKED(value)   (SPW_PKTRX1_PREVBUFSTS_LOCKED_Msk & ((value) << SPW_PKTRX1_PREVBUFSTS_LOCKED_Pos))
#define SPW_PKTRX1_PREVBUFSTS_Msk             _U_(0x800FFFFF)                                      /**< (SPW_PKTRX1_PREVBUFSTS) Register Mask  */


/* -------- SPW_PKTRX1_SWRESET : (SPW Offset: 0x87C) (R/W 32) PktRx Software Reset -------- */
#define SPW_PKTRX1_SWRESET_PATTERN_Pos        _U_(0)                                               /**< (SPW_PKTRX1_SWRESET) Pattern Position */
#define SPW_PKTRX1_SWRESET_PATTERN_Msk        (_U_(0xFFFFFFFF) << SPW_PKTRX1_SWRESET_PATTERN_Pos)  /**< (SPW_PKTRX1_SWRESET) Pattern Mask */
#define SPW_PKTRX1_SWRESET_PATTERN(value)     (SPW_PKTRX1_SWRESET_PATTERN_Msk & ((value) << SPW_PKTRX1_SWRESET_PATTERN_Pos))
#define SPW_PKTRX1_SWRESET_Msk                _U_(0xFFFFFFFF)                                      /**< (SPW_PKTRX1_SWRESET) Register Mask  */


/* -------- SPW_PKTTX1_PI_RM : (SPW Offset: 0xC00) ( R/ 32) PktTx Pending Read Masked Interrupt -------- */
#define SPW_PKTTX1_PI_RM_DEACT_Pos            _U_(0)                                               /**< (SPW_PKTTX1_PI_RM) Deactivated Position */
#define SPW_PKTTX1_PI_RM_DEACT_Msk            (_U_(0x1) << SPW_PKTTX1_PI_RM_DEACT_Pos)             /**< (SPW_PKTTX1_PI_RM) Deactivated Mask */
#define SPW_PKTTX1_PI_RM_DEACT(value)         (SPW_PKTTX1_PI_RM_DEACT_Msk & ((value) << SPW_PKTTX1_PI_RM_DEACT_Pos))
#define SPW_PKTTX1_PI_RM_ACT_Pos              _U_(1)                                               /**< (SPW_PKTTX1_PI_RM) Activated Position */
#define SPW_PKTTX1_PI_RM_ACT_Msk              (_U_(0x1) << SPW_PKTTX1_PI_RM_ACT_Pos)               /**< (SPW_PKTTX1_PI_RM) Activated Mask */
#define SPW_PKTTX1_PI_RM_ACT(value)           (SPW_PKTTX1_PI_RM_ACT_Msk & ((value) << SPW_PKTTX1_PI_RM_ACT_Pos))
#define SPW_PKTTX1_PI_RM_EOP_Pos              _U_(2)                                               /**< (SPW_PKTTX1_PI_RM) EOP sent Position */
#define SPW_PKTTX1_PI_RM_EOP_Msk              (_U_(0x1) << SPW_PKTTX1_PI_RM_EOP_Pos)               /**< (SPW_PKTTX1_PI_RM) EOP sent Mask */
#define SPW_PKTTX1_PI_RM_EOP(value)           (SPW_PKTTX1_PI_RM_EOP_Msk & ((value) << SPW_PKTTX1_PI_RM_EOP_Pos))
#define SPW_PKTTX1_PI_RM_EEP_Pos              _U_(3)                                               /**< (SPW_PKTTX1_PI_RM) EEP sent Position */
#define SPW_PKTTX1_PI_RM_EEP_Msk              (_U_(0x1) << SPW_PKTTX1_PI_RM_EEP_Pos)               /**< (SPW_PKTTX1_PI_RM) EEP sent Mask */
#define SPW_PKTTX1_PI_RM_EEP(value)           (SPW_PKTTX1_PI_RM_EEP_Msk & ((value) << SPW_PKTTX1_PI_RM_EEP_Pos))
#define SPW_PKTTX1_PI_RM_Msk                  _U_(0x0000000F)                                      /**< (SPW_PKTTX1_PI_RM) Register Mask  */


/* -------- SPW_PKTTX1_PI_RCM : (SPW Offset: 0xC04) ( R/ 32) PktTx Pending Read and Clear Masked Interrupt -------- */
#define SPW_PKTTX1_PI_RCM_DEACT_Pos           _U_(0)                                               /**< (SPW_PKTTX1_PI_RCM) Deactivated Position */
#define SPW_PKTTX1_PI_RCM_DEACT_Msk           (_U_(0x1) << SPW_PKTTX1_PI_RCM_DEACT_Pos)            /**< (SPW_PKTTX1_PI_RCM) Deactivated Mask */
#define SPW_PKTTX1_PI_RCM_DEACT(value)        (SPW_PKTTX1_PI_RCM_DEACT_Msk & ((value) << SPW_PKTTX1_PI_RCM_DEACT_Pos))
#define SPW_PKTTX1_PI_RCM_ACT_Pos             _U_(1)                                               /**< (SPW_PKTTX1_PI_RCM) Activated Position */
#define SPW_PKTTX1_PI_RCM_ACT_Msk             (_U_(0x1) << SPW_PKTTX1_PI_RCM_ACT_Pos)              /**< (SPW_PKTTX1_PI_RCM) Activated Mask */
#define SPW_PKTTX1_PI_RCM_ACT(value)          (SPW_PKTTX1_PI_RCM_ACT_Msk & ((value) << SPW_PKTTX1_PI_RCM_ACT_Pos))
#define SPW_PKTTX1_PI_RCM_EOP_Pos             _U_(2)                                               /**< (SPW_PKTTX1_PI_RCM) EOP sent Position */
#define SPW_PKTTX1_PI_RCM_EOP_Msk             (_U_(0x1) << SPW_PKTTX1_PI_RCM_EOP_Pos)              /**< (SPW_PKTTX1_PI_RCM) EOP sent Mask */
#define SPW_PKTTX1_PI_RCM_EOP(value)          (SPW_PKTTX1_PI_RCM_EOP_Msk & ((value) << SPW_PKTTX1_PI_RCM_EOP_Pos))
#define SPW_PKTTX1_PI_RCM_EEP_Pos             _U_(3)                                               /**< (SPW_PKTTX1_PI_RCM) EEP sent Position */
#define SPW_PKTTX1_PI_RCM_EEP_Msk             (_U_(0x1) << SPW_PKTTX1_PI_RCM_EEP_Pos)              /**< (SPW_PKTTX1_PI_RCM) EEP sent Mask */
#define SPW_PKTTX1_PI_RCM_EEP(value)          (SPW_PKTTX1_PI_RCM_EEP_Msk & ((value) << SPW_PKTTX1_PI_RCM_EEP_Pos))
#define SPW_PKTTX1_PI_RCM_Msk                 _U_(0x0000000F)                                      /**< (SPW_PKTTX1_PI_RCM) Register Mask  */


/* -------- SPW_PKTTX1_PI_R : (SPW Offset: 0xC08) ( R/ 32) PktTx Pending Read Interrupt -------- */
#define SPW_PKTTX1_PI_R_DEACT_Pos             _U_(0)                                               /**< (SPW_PKTTX1_PI_R) Deactivated Position */
#define SPW_PKTTX1_PI_R_DEACT_Msk             (_U_(0x1) << SPW_PKTTX1_PI_R_DEACT_Pos)              /**< (SPW_PKTTX1_PI_R) Deactivated Mask */
#define SPW_PKTTX1_PI_R_DEACT(value)          (SPW_PKTTX1_PI_R_DEACT_Msk & ((value) << SPW_PKTTX1_PI_R_DEACT_Pos))
#define SPW_PKTTX1_PI_R_ACT_Pos               _U_(1)                                               /**< (SPW_PKTTX1_PI_R) Activated Position */
#define SPW_PKTTX1_PI_R_ACT_Msk               (_U_(0x1) << SPW_PKTTX1_PI_R_ACT_Pos)                /**< (SPW_PKTTX1_PI_R) Activated Mask */
#define SPW_PKTTX1_PI_R_ACT(value)            (SPW_PKTTX1_PI_R_ACT_Msk & ((value) << SPW_PKTTX1_PI_R_ACT_Pos))
#define SPW_PKTTX1_PI_R_EOP_Pos               _U_(2)                                               /**< (SPW_PKTTX1_PI_R) EOP sent Position */
#define SPW_PKTTX1_PI_R_EOP_Msk               (_U_(0x1) << SPW_PKTTX1_PI_R_EOP_Pos)                /**< (SPW_PKTTX1_PI_R) EOP sent Mask */
#define SPW_PKTTX1_PI_R_EOP(value)            (SPW_PKTTX1_PI_R_EOP_Msk & ((value) << SPW_PKTTX1_PI_R_EOP_Pos))
#define SPW_PKTTX1_PI_R_EEP_Pos               _U_(3)                                               /**< (SPW_PKTTX1_PI_R) EEP sent Position */
#define SPW_PKTTX1_PI_R_EEP_Msk               (_U_(0x1) << SPW_PKTTX1_PI_R_EEP_Pos)                /**< (SPW_PKTTX1_PI_R) EEP sent Mask */
#define SPW_PKTTX1_PI_R_EEP(value)            (SPW_PKTTX1_PI_R_EEP_Msk & ((value) << SPW_PKTTX1_PI_R_EEP_Pos))
#define SPW_PKTTX1_PI_R_Msk                   _U_(0x0000000F)                                      /**< (SPW_PKTTX1_PI_R) Register Mask  */


