Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/spw.h
/* -------- SPW_PKTTX1_SWRESET : (SPW Offset: 0xC3C) (R/W 32) PktTx Software Reset -------- */
#define SPW_PKTTX1_SWRESET_PATTERN_Pos        _U_(0)                                               /**< (SPW_PKTTX1_SWRESET) Pattern Position */
#define SPW_PKTTX1_SWRESET_PATTERN_Msk        (_U_(0xFFFFFFFF) << SPW_PKTTX1_SWRESET_PATTERN_Pos)  /**< (SPW_PKTTX1_SWRESET) Pattern Mask */
#define SPW_PKTTX1_SWRESET_PATTERN(value)     (SPW_PKTTX1_SWRESET_PATTERN_Msk & ((value) << SPW_PKTTX1_SWRESET_PATTERN_Pos))
#define SPW_PKTTX1_SWRESET_Msk                _U_(0xFFFFFFFF)                                      /**< (SPW_PKTTX1_SWRESET) Register Mask  */


/* -------- SPW_RMAP1_CFG : (SPW Offset: 0xE00) (R/W 32) SpW RMAP 1 Config -------- */
#define SPW_RMAP1_CFG_DESTKEY_Pos             _U_(0)                                               /**< (SPW_RMAP1_CFG) DestKey Position */
#define SPW_RMAP1_CFG_DESTKEY_Msk             (_U_(0xFF) << SPW_RMAP1_CFG_DESTKEY_Pos)             /**< (SPW_RMAP1_CFG) DestKey Mask */
#define SPW_RMAP1_CFG_DESTKEY(value)          (SPW_RMAP1_CFG_DESTKEY_Msk & ((value) << SPW_RMAP1_CFG_DESTKEY_Pos))
#define SPW_RMAP1_CFG_TLA_Pos                 _U_(8)                                               /**< (SPW_RMAP1_CFG) Address Position */
#define SPW_RMAP1_CFG_TLA_Msk                 (_U_(0xFF) << SPW_RMAP1_CFG_TLA_Pos)                 /**< (SPW_RMAP1_CFG) Address Mask */
#define SPW_RMAP1_CFG_TLA(value)              (SPW_RMAP1_CFG_TLA_Msk & ((value) << SPW_RMAP1_CFG_TLA_Pos))
#define SPW_RMAP1_CFG_RMAPENA_Pos             _U_(16)                                              /**< (SPW_RMAP1_CFG) RMAP Enable Position */
#define SPW_RMAP1_CFG_RMAPENA_Msk             (_U_(0x1) << SPW_RMAP1_CFG_RMAPENA_Pos)              /**< (SPW_RMAP1_CFG) RMAP Enable Mask */
#define SPW_RMAP1_CFG_RMAPENA(value)          (SPW_RMAP1_CFG_RMAPENA_Msk & ((value) << SPW_RMAP1_CFG_RMAPENA_Pos))
#define SPW_RMAP1_CFG_Msk                     _U_(0x0001FFFF)                                      /**< (SPW_RMAP1_CFG) Register Mask  */


/* -------- SPW_RMAP1_STS_RC : (SPW Offset: 0xE04) ( R/ 32) SpW RMAP 1 Read and Clear Status -------- */
#define SPW_RMAP1_STS_RC_ERRCODE_Pos          _U_(0)                                               /**< (SPW_RMAP1_STS_RC) Error Code Position */
#define SPW_RMAP1_STS_RC_ERRCODE_Msk          (_U_(0xFF) << SPW_RMAP1_STS_RC_ERRCODE_Pos)          /**< (SPW_RMAP1_STS_RC) Error Code Mask */
#define SPW_RMAP1_STS_RC_ERRCODE(value)       (SPW_RMAP1_STS_RC_ERRCODE_Msk & ((value) << SPW_RMAP1_STS_RC_ERRCODE_Pos))
#define   SPW_RMAP1_STS_RC_ERRCODE_NOERROR_Val _U_(0x0)                                             /**< (SPW_RMAP1_STS_RC) No error detected  */
#define   SPW_RMAP1_STS_RC_ERRCODE_DMAERROR_Val _U_(0x1)                                             /**< (SPW_RMAP1_STS_RC) Error while DMA accessing the internal bus, e.g. illegal address.  */
#define   SPW_RMAP1_STS_RC_ERRCODE_RMAPERROR_Val _U_(0x2)                                             /**< (SPW_RMAP1_STS_RC) Unused RMAP command according to [RMAP]  */
#define   SPW_RMAP1_STS_RC_ERRCODE_DESTKEYERROR_Val _U_(0x3)                                             /**< (SPW_RMAP1_STS_RC) Destination key error  */
#define   SPW_RMAP1_STS_RC_ERRCODE_DATACRCERROR_Val _U_(0x4)                                             /**< (SPW_RMAP1_STS_RC) Data CRC error  */
#define   SPW_RMAP1_STS_RC_ERRCODE_EOPERROR_Val _U_(0x5)                                             /**< (SPW_RMAP1_STS_RC) Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header.  */
#define   SPW_RMAP1_STS_RC_ERRCODE_CARGOERROR_Val _U_(0x6)                                             /**< (SPW_RMAP1_STS_RC) Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header.  */
#define   SPW_RMAP1_STS_RC_ERRCODE_EEPERROR_Val _U_(0x7)                                             /**< (SPW_RMAP1_STS_RC) Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header.  */
#define   SPW_RMAP1_STS_RC_ERRCODE_CMDERROR_Val _U_(0xA)                                             /**< (SPW_RMAP1_STS_RC) Authorisation error:Invalid or unsupported command.  */
#define   SPW_RMAP1_STS_RC_ERRCODE_TLAERROR_Val _U_(0xC)                                             /**< (SPW_RMAP1_STS_RC) Non-matching Target Logical Address.  */
#define   SPW_RMAP1_STS_RC_ERRCODE_HEADERCRCERROR_Val _U_(0x10)                                            /**< (SPW_RMAP1_STS_RC) Incorrect header CRC.  */
#define   SPW_RMAP1_STS_RC_ERRCODE_PROTOCOLIDERROR_Val _U_(0x11)                                            /**< (SPW_RMAP1_STS_RC) Protocol Identifier not supported.  */
#define   SPW_RMAP1_STS_RC_ERRCODE_REPLYADDERROR_Val _U_(0x12)                                            /**< (SPW_RMAP1_STS_RC) Unsupported reply address length  */
#define SPW_RMAP1_STS_RC_ERRCODE_NOERROR      (SPW_RMAP1_STS_RC_ERRCODE_NOERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) No error detected Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_DMAERROR     (SPW_RMAP1_STS_RC_ERRCODE_DMAERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Error while DMA accessing the internal bus, e.g. illegal address. Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_RMAPERROR    (SPW_RMAP1_STS_RC_ERRCODE_RMAPERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Unused RMAP command according to [RMAP] Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_DESTKEYERROR (SPW_RMAP1_STS_RC_ERRCODE_DESTKEYERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Destination key error Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_DATACRCERROR (SPW_RMAP1_STS_RC_ERRCODE_DATACRCERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Data CRC error Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_EOPERROR     (SPW_RMAP1_STS_RC_ERRCODE_EOPERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header. Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_CARGOERROR   (SPW_RMAP1_STS_RC_ERRCODE_CARGOERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header. Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_EEPERROR     (SPW_RMAP1_STS_RC_ERRCODE_EEPERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header. Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_CMDERROR     (SPW_RMAP1_STS_RC_ERRCODE_CMDERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Authorisation error:Invalid or unsupported command. Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_TLAERROR     (SPW_RMAP1_STS_RC_ERRCODE_TLAERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Non-matching Target Logical Address. Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_HEADERCRCERROR (SPW_RMAP1_STS_RC_ERRCODE_HEADERCRCERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Incorrect header CRC. Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_PROTOCOLIDERROR (SPW_RMAP1_STS_RC_ERRCODE_PROTOCOLIDERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Protocol Identifier not supported. Position  */
#define SPW_RMAP1_STS_RC_ERRCODE_REPLYADDERROR (SPW_RMAP1_STS_RC_ERRCODE_REPLYADDERROR_Val << SPW_RMAP1_STS_RC_ERRCODE_Pos) /**< (SPW_RMAP1_STS_RC) Unsupported reply address length Position  */
#define SPW_RMAP1_STS_RC_VALID_Pos            _U_(8)                                               /**< (SPW_RMAP1_STS_RC) Valid Position */
#define SPW_RMAP1_STS_RC_VALID_Msk            (_U_(0x1) << SPW_RMAP1_STS_RC_VALID_Pos)             /**< (SPW_RMAP1_STS_RC) Valid Mask */
#define SPW_RMAP1_STS_RC_VALID(value)         (SPW_RMAP1_STS_RC_VALID_Msk & ((value) << SPW_RMAP1_STS_RC_VALID_Pos))
#define SPW_RMAP1_STS_RC_Msk                  _U_(0x000001FF)                                      /**< (SPW_RMAP1_STS_RC) Register Mask  */


/* -------- SPW_RMAP1_STS : (SPW Offset: 0xE08) ( R/ 32) SpW RMAP 1 Read Status -------- */
#define SPW_RMAP1_STS_ERRCODE_Pos             _U_(0)                                               /**< (SPW_RMAP1_STS) Error Code Position */
#define SPW_RMAP1_STS_ERRCODE_Msk             (_U_(0xFF) << SPW_RMAP1_STS_ERRCODE_Pos)             /**< (SPW_RMAP1_STS) Error Code Mask */
#define SPW_RMAP1_STS_ERRCODE(value)          (SPW_RMAP1_STS_ERRCODE_Msk & ((value) << SPW_RMAP1_STS_ERRCODE_Pos))
#define   SPW_RMAP1_STS_ERRCODE_NOERROR_Val   _U_(0x0)                                             /**< (SPW_RMAP1_STS) No error detected  */
#define   SPW_RMAP1_STS_ERRCODE_DMAERROR_Val  _U_(0x1)                                             /**< (SPW_RMAP1_STS) Error while DMA accessing the internal bus, e.g. illegal address.  */
#define   SPW_RMAP1_STS_ERRCODE_RMAPERROR_Val _U_(0x2)                                             /**< (SPW_RMAP1_STS) Unused RMAP command according to [RMAP]  */
#define   SPW_RMAP1_STS_ERRCODE_DESTKEYERROR_Val _U_(0x3)                                             /**< (SPW_RMAP1_STS) Destination key error  */
#define   SPW_RMAP1_STS_ERRCODE_DATACRCERROR_Val _U_(0x4)                                             /**< (SPW_RMAP1_STS) Data CRC error  */
#define   SPW_RMAP1_STS_ERRCODE_EOPERROR_Val  _U_(0x5)                                             /**< (SPW_RMAP1_STS) Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header.  */
#define   SPW_RMAP1_STS_ERRCODE_CARGOERROR_Val _U_(0x6)                                             /**< (SPW_RMAP1_STS) Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header.  */
#define   SPW_RMAP1_STS_ERRCODE_EEPERROR_Val  _U_(0x7)                                             /**< (SPW_RMAP1_STS) Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header.  */
#define   SPW_RMAP1_STS_ERRCODE_CMDERROR_Val  _U_(0xA)                                             /**< (SPW_RMAP1_STS) Authorisation error:Invalid or unsupported command.  */
#define   SPW_RMAP1_STS_ERRCODE_TLAERROR_Val  _U_(0xC)                                             /**< (SPW_RMAP1_STS) Non-matching Target Logical Address.  */
#define   SPW_RMAP1_STS_ERRCODE_HEADERCRCERROR_Val _U_(0x10)                                            /**< (SPW_RMAP1_STS) Incorrect header CRC.  */
#define   SPW_RMAP1_STS_ERRCODE_PROTOCOLIDERROR_Val _U_(0x11)                                            /**< (SPW_RMAP1_STS) Protocol Identifier not supported.  */
#define   SPW_RMAP1_STS_ERRCODE_REPLYADDERROR_Val _U_(0x12)                                            /**< (SPW_RMAP1_STS) Unsupported reply address length  */
#define SPW_RMAP1_STS_ERRCODE_NOERROR         (SPW_RMAP1_STS_ERRCODE_NOERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) No error detected Position  */
#define SPW_RMAP1_STS_ERRCODE_DMAERROR        (SPW_RMAP1_STS_ERRCODE_DMAERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Error while DMA accessing the internal bus, e.g. illegal address. Position  */
#define SPW_RMAP1_STS_ERRCODE_RMAPERROR       (SPW_RMAP1_STS_ERRCODE_RMAPERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Unused RMAP command according to [RMAP] Position  */
#define SPW_RMAP1_STS_ERRCODE_DESTKEYERROR    (SPW_RMAP1_STS_ERRCODE_DESTKEYERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Destination key error Position  */
#define SPW_RMAP1_STS_ERRCODE_DATACRCERROR    (SPW_RMAP1_STS_ERRCODE_DATACRCERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Data CRC error Position  */
#define SPW_RMAP1_STS_ERRCODE_EOPERROR        (SPW_RMAP1_STS_ERRCODE_EOPERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header. Position  */
#define SPW_RMAP1_STS_ERRCODE_CARGOERROR      (SPW_RMAP1_STS_ERRCODE_CARGOERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header. Position  */
#define SPW_RMAP1_STS_ERRCODE_EEPERROR        (SPW_RMAP1_STS_ERRCODE_EEPERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header. Position  */
#define SPW_RMAP1_STS_ERRCODE_CMDERROR        (SPW_RMAP1_STS_ERRCODE_CMDERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Authorisation error:Invalid or unsupported command. Position  */
#define SPW_RMAP1_STS_ERRCODE_TLAERROR        (SPW_RMAP1_STS_ERRCODE_TLAERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Non-matching Target Logical Address. Position  */
#define SPW_RMAP1_STS_ERRCODE_HEADERCRCERROR  (SPW_RMAP1_STS_ERRCODE_HEADERCRCERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Incorrect header CRC. Position  */
#define SPW_RMAP1_STS_ERRCODE_PROTOCOLIDERROR (SPW_RMAP1_STS_ERRCODE_PROTOCOLIDERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Protocol Identifier not supported. Position  */
#define SPW_RMAP1_STS_ERRCODE_REPLYADDERROR   (SPW_RMAP1_STS_ERRCODE_REPLYADDERROR_Val << SPW_RMAP1_STS_ERRCODE_Pos) /**< (SPW_RMAP1_STS) Unsupported reply address length Position  */
#define SPW_RMAP1_STS_VALID_Pos               _U_(8)                                               /**< (SPW_RMAP1_STS) Valid Position */
#define SPW_RMAP1_STS_VALID_Msk               (_U_(0x1) << SPW_RMAP1_STS_VALID_Pos)                /**< (SPW_RMAP1_STS) Valid Mask */
#define SPW_RMAP1_STS_VALID(value)            (SPW_RMAP1_STS_VALID_Msk & ((value) << SPW_RMAP1_STS_VALID_Pos))
#define SPW_RMAP1_STS_Msk                     _U_(0x000001FF)                                      /**< (SPW_RMAP1_STS) Register Mask  */


