Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/spw.h
/* -------- SPW_TCH_PI_RM : (SPW Offset: 0xE80) ( R/ 32) SpW Tch Pending Read Masked Interrupt -------- */
#define SPW_TCH_PI_RM_TCEVENT_Pos             _U_(0)                                               /**< (SPW_TCH_PI_RM) TcEvent Position */
#define SPW_TCH_PI_RM_TCEVENT_Msk             (_U_(0x1) << SPW_TCH_PI_RM_TCEVENT_Pos)              /**< (SPW_TCH_PI_RM) TcEvent Mask */
#define SPW_TCH_PI_RM_TCEVENT(value)          (SPW_TCH_PI_RM_TCEVENT_Msk & ((value) << SPW_TCH_PI_RM_TCEVENT_Pos))
#define SPW_TCH_PI_RM_TIMECODE_Pos            _U_(1)                                               /**< (SPW_TCH_PI_RM) Time Code Position */
#define SPW_TCH_PI_RM_TIMECODE_Msk            (_U_(0x1) << SPW_TCH_PI_RM_TIMECODE_Pos)             /**< (SPW_TCH_PI_RM) Time Code Mask */
#define SPW_TCH_PI_RM_TIMECODE(value)         (SPW_TCH_PI_RM_TIMECODE_Msk & ((value) << SPW_TCH_PI_RM_TIMECODE_Pos))
#define SPW_TCH_PI_RM_ANYTIMECODE_Pos         _U_(2)                                               /**< (SPW_TCH_PI_RM) Any Time Code Position */
#define SPW_TCH_PI_RM_ANYTIMECODE_Msk         (_U_(0x1) << SPW_TCH_PI_RM_ANYTIMECODE_Pos)          /**< (SPW_TCH_PI_RM) Any Time Code Mask */
#define SPW_TCH_PI_RM_ANYTIMECODE(value)      (SPW_TCH_PI_RM_ANYTIMECODE_Msk & ((value) << SPW_TCH_PI_RM_ANYTIMECODE_Pos))
#define SPW_TCH_PI_RM_LATEWD_Pos              _U_(3)                                               /**< (SPW_TCH_PI_RM) Late Watchdog Position */
#define SPW_TCH_PI_RM_LATEWD_Msk              (_U_(0x1) << SPW_TCH_PI_RM_LATEWD_Pos)               /**< (SPW_TCH_PI_RM) Late Watchdog Mask */
#define SPW_TCH_PI_RM_LATEWD(value)           (SPW_TCH_PI_RM_LATEWD_Msk & ((value) << SPW_TCH_PI_RM_LATEWD_Pos))
#define SPW_TCH_PI_RM_EARLYWD_Pos             _U_(4)                                               /**< (SPW_TCH_PI_RM) Early Watchdog Position */
#define SPW_TCH_PI_RM_EARLYWD_Msk             (_U_(0x1) << SPW_TCH_PI_RM_EARLYWD_Pos)              /**< (SPW_TCH_PI_RM) Early Watchdog Mask */
#define SPW_TCH_PI_RM_EARLYWD(value)          (SPW_TCH_PI_RM_EARLYWD_Msk & ((value) << SPW_TCH_PI_RM_EARLYWD_Pos))
#define SPW_TCH_PI_RM_Msk                     _U_(0x0000001F)                                      /**< (SPW_TCH_PI_RM) Register Mask  */


/* -------- SPW_TCH_PI_RCM : (SPW Offset: 0xE84) ( R/ 32) SpW Tch Pending Read and Clear Masked Interrupt -------- */
#define SPW_TCH_PI_RCM_TCEVENT_Pos            _U_(0)                                               /**< (SPW_TCH_PI_RCM) TcEvent Position */
#define SPW_TCH_PI_RCM_TCEVENT_Msk            (_U_(0x1) << SPW_TCH_PI_RCM_TCEVENT_Pos)             /**< (SPW_TCH_PI_RCM) TcEvent Mask */
#define SPW_TCH_PI_RCM_TCEVENT(value)         (SPW_TCH_PI_RCM_TCEVENT_Msk & ((value) << SPW_TCH_PI_RCM_TCEVENT_Pos))
#define SPW_TCH_PI_RCM_TIMECODE_Pos           _U_(1)                                               /**< (SPW_TCH_PI_RCM) Time Code Position */
#define SPW_TCH_PI_RCM_TIMECODE_Msk           (_U_(0x1) << SPW_TCH_PI_RCM_TIMECODE_Pos)            /**< (SPW_TCH_PI_RCM) Time Code Mask */
#define SPW_TCH_PI_RCM_TIMECODE(value)        (SPW_TCH_PI_RCM_TIMECODE_Msk & ((value) << SPW_TCH_PI_RCM_TIMECODE_Pos))
#define SPW_TCH_PI_RCM_ANYTIMECODE_Pos        _U_(2)                                               /**< (SPW_TCH_PI_RCM) Any Time Code Position */
#define SPW_TCH_PI_RCM_ANYTIMECODE_Msk        (_U_(0x1) << SPW_TCH_PI_RCM_ANYTIMECODE_Pos)         /**< (SPW_TCH_PI_RCM) Any Time Code Mask */
#define SPW_TCH_PI_RCM_ANYTIMECODE(value)     (SPW_TCH_PI_RCM_ANYTIMECODE_Msk & ((value) << SPW_TCH_PI_RCM_ANYTIMECODE_Pos))
#define SPW_TCH_PI_RCM_LATEWD_Pos             _U_(3)                                               /**< (SPW_TCH_PI_RCM) Late Watchdog Position */
#define SPW_TCH_PI_RCM_LATEWD_Msk             (_U_(0x1) << SPW_TCH_PI_RCM_LATEWD_Pos)              /**< (SPW_TCH_PI_RCM) Late Watchdog Mask */
#define SPW_TCH_PI_RCM_LATEWD(value)          (SPW_TCH_PI_RCM_LATEWD_Msk & ((value) << SPW_TCH_PI_RCM_LATEWD_Pos))
#define SPW_TCH_PI_RCM_EARLYWD_Pos            _U_(4)                                               /**< (SPW_TCH_PI_RCM) Early Watchdog Position */
#define SPW_TCH_PI_RCM_EARLYWD_Msk            (_U_(0x1) << SPW_TCH_PI_RCM_EARLYWD_Pos)             /**< (SPW_TCH_PI_RCM) Early Watchdog Mask */
#define SPW_TCH_PI_RCM_EARLYWD(value)         (SPW_TCH_PI_RCM_EARLYWD_Msk & ((value) << SPW_TCH_PI_RCM_EARLYWD_Pos))
#define SPW_TCH_PI_RCM_Msk                    _U_(0x0000001F)                                      /**< (SPW_TCH_PI_RCM) Register Mask  */


/* -------- SPW_TCH_PI_R : (SPW Offset: 0xE88) ( R/ 32) SpW Tch Pending Read Interrupt -------- */
#define SPW_TCH_PI_R_TCEVENT_Pos              _U_(0)                                               /**< (SPW_TCH_PI_R) TcEvent Position */
#define SPW_TCH_PI_R_TCEVENT_Msk              (_U_(0x1) << SPW_TCH_PI_R_TCEVENT_Pos)               /**< (SPW_TCH_PI_R) TcEvent Mask */
#define SPW_TCH_PI_R_TCEVENT(value)           (SPW_TCH_PI_R_TCEVENT_Msk & ((value) << SPW_TCH_PI_R_TCEVENT_Pos))
#define SPW_TCH_PI_R_TIMECODE_Pos             _U_(1)                                               /**< (SPW_TCH_PI_R) Time Code Position */
#define SPW_TCH_PI_R_TIMECODE_Msk             (_U_(0x1) << SPW_TCH_PI_R_TIMECODE_Pos)              /**< (SPW_TCH_PI_R) Time Code Mask */
#define SPW_TCH_PI_R_TIMECODE(value)          (SPW_TCH_PI_R_TIMECODE_Msk & ((value) << SPW_TCH_PI_R_TIMECODE_Pos))
#define SPW_TCH_PI_R_ANYTIMECODE_Pos          _U_(2)                                               /**< (SPW_TCH_PI_R) Any Time Code Position */
#define SPW_TCH_PI_R_ANYTIMECODE_Msk          (_U_(0x1) << SPW_TCH_PI_R_ANYTIMECODE_Pos)           /**< (SPW_TCH_PI_R) Any Time Code Mask */
#define SPW_TCH_PI_R_ANYTIMECODE(value)       (SPW_TCH_PI_R_ANYTIMECODE_Msk & ((value) << SPW_TCH_PI_R_ANYTIMECODE_Pos))
#define SPW_TCH_PI_R_LATEWD_Pos               _U_(3)                                               /**< (SPW_TCH_PI_R) Late Watchdog Position */
#define SPW_TCH_PI_R_LATEWD_Msk               (_U_(0x1) << SPW_TCH_PI_R_LATEWD_Pos)                /**< (SPW_TCH_PI_R) Late Watchdog Mask */
#define SPW_TCH_PI_R_LATEWD(value)            (SPW_TCH_PI_R_LATEWD_Msk & ((value) << SPW_TCH_PI_R_LATEWD_Pos))
#define SPW_TCH_PI_R_EARLYWD_Pos              _U_(4)                                               /**< (SPW_TCH_PI_R) Early Watchdog Position */
#define SPW_TCH_PI_R_EARLYWD_Msk              (_U_(0x1) << SPW_TCH_PI_R_EARLYWD_Pos)               /**< (SPW_TCH_PI_R) Early Watchdog Mask */
#define SPW_TCH_PI_R_EARLYWD(value)           (SPW_TCH_PI_R_EARLYWD_Msk & ((value) << SPW_TCH_PI_R_EARLYWD_Pos))
#define SPW_TCH_PI_R_Msk                      _U_(0x0000001F)                                      /**< (SPW_TCH_PI_R) Register Mask  */


/* -------- SPW_TCH_PI_RCS : (SPW Offset: 0xE8C) (R/W 32) SpW Tch Pending Read, Clear and Enabled Interrupt -------- */
#define SPW_TCH_PI_RCS_TCEVENT_Pos            _U_(0)                                               /**< (SPW_TCH_PI_RCS) TcEvent Position */
#define SPW_TCH_PI_RCS_TCEVENT_Msk            (_U_(0x1) << SPW_TCH_PI_RCS_TCEVENT_Pos)             /**< (SPW_TCH_PI_RCS) TcEvent Mask */
#define SPW_TCH_PI_RCS_TCEVENT(value)         (SPW_TCH_PI_RCS_TCEVENT_Msk & ((value) << SPW_TCH_PI_RCS_TCEVENT_Pos))
#define SPW_TCH_PI_RCS_TIMECODE_Pos           _U_(1)                                               /**< (SPW_TCH_PI_RCS) Time Code Position */
#define SPW_TCH_PI_RCS_TIMECODE_Msk           (_U_(0x1) << SPW_TCH_PI_RCS_TIMECODE_Pos)            /**< (SPW_TCH_PI_RCS) Time Code Mask */
#define SPW_TCH_PI_RCS_TIMECODE(value)        (SPW_TCH_PI_RCS_TIMECODE_Msk & ((value) << SPW_TCH_PI_RCS_TIMECODE_Pos))
#define SPW_TCH_PI_RCS_ANYTIMECODE_Pos        _U_(2)                                               /**< (SPW_TCH_PI_RCS) Any Time Code Position */
#define SPW_TCH_PI_RCS_ANYTIMECODE_Msk        (_U_(0x1) << SPW_TCH_PI_RCS_ANYTIMECODE_Pos)         /**< (SPW_TCH_PI_RCS) Any Time Code Mask */
#define SPW_TCH_PI_RCS_ANYTIMECODE(value)     (SPW_TCH_PI_RCS_ANYTIMECODE_Msk & ((value) << SPW_TCH_PI_RCS_ANYTIMECODE_Pos))
#define SPW_TCH_PI_RCS_LATEWD_Pos             _U_(3)                                               /**< (SPW_TCH_PI_RCS) Late Watchdog Position */
#define SPW_TCH_PI_RCS_LATEWD_Msk             (_U_(0x1) << SPW_TCH_PI_RCS_LATEWD_Pos)              /**< (SPW_TCH_PI_RCS) Late Watchdog Mask */
#define SPW_TCH_PI_RCS_LATEWD(value)          (SPW_TCH_PI_RCS_LATEWD_Msk & ((value) << SPW_TCH_PI_RCS_LATEWD_Pos))
#define SPW_TCH_PI_RCS_EARLYWD_Pos            _U_(4)                                               /**< (SPW_TCH_PI_RCS) Early Watchdog Position */
#define SPW_TCH_PI_RCS_EARLYWD_Msk            (_U_(0x1) << SPW_TCH_PI_RCS_EARLYWD_Pos)             /**< (SPW_TCH_PI_RCS) Early Watchdog Mask */
#define SPW_TCH_PI_RCS_EARLYWD(value)         (SPW_TCH_PI_RCS_EARLYWD_Msk & ((value) << SPW_TCH_PI_RCS_EARLYWD_Pos))
#define SPW_TCH_PI_RCS_Msk                    _U_(0x0000001F)                                      /**< (SPW_TCH_PI_RCS) Register Mask  */


/* -------- SPW_TCH_IM : (SPW Offset: 0xE90) (R/W 32) SpW Tch Interrupt Mask -------- */
#define SPW_TCH_IM_TCEVENT_Pos                _U_(0)                                               /**< (SPW_TCH_IM) TcEvent Position */
#define SPW_TCH_IM_TCEVENT_Msk                (_U_(0x1) << SPW_TCH_IM_TCEVENT_Pos)                 /**< (SPW_TCH_IM) TcEvent Mask */
#define SPW_TCH_IM_TCEVENT(value)             (SPW_TCH_IM_TCEVENT_Msk & ((value) << SPW_TCH_IM_TCEVENT_Pos))
#define SPW_TCH_IM_TIMECODE_Pos               _U_(1)                                               /**< (SPW_TCH_IM) Time Code Position */
#define SPW_TCH_IM_TIMECODE_Msk               (_U_(0x1) << SPW_TCH_IM_TIMECODE_Pos)                /**< (SPW_TCH_IM) Time Code Mask */
#define SPW_TCH_IM_TIMECODE(value)            (SPW_TCH_IM_TIMECODE_Msk & ((value) << SPW_TCH_IM_TIMECODE_Pos))
#define SPW_TCH_IM_ANYTIMECODE_Pos            _U_(2)                                               /**< (SPW_TCH_IM) Any Time Code Position */
#define SPW_TCH_IM_ANYTIMECODE_Msk            (_U_(0x1) << SPW_TCH_IM_ANYTIMECODE_Pos)             /**< (SPW_TCH_IM) Any Time Code Mask */
#define SPW_TCH_IM_ANYTIMECODE(value)         (SPW_TCH_IM_ANYTIMECODE_Msk & ((value) << SPW_TCH_IM_ANYTIMECODE_Pos))
#define SPW_TCH_IM_LATEWD_Pos                 _U_(3)                                               /**< (SPW_TCH_IM) Late Watchdog Position */
#define SPW_TCH_IM_LATEWD_Msk                 (_U_(0x1) << SPW_TCH_IM_LATEWD_Pos)                  /**< (SPW_TCH_IM) Late Watchdog Mask */
#define SPW_TCH_IM_LATEWD(value)              (SPW_TCH_IM_LATEWD_Msk & ((value) << SPW_TCH_IM_LATEWD_Pos))
#define SPW_TCH_IM_EARLYWD_Pos                _U_(4)                                               /**< (SPW_TCH_IM) Early Watchdog Position */
#define SPW_TCH_IM_EARLYWD_Msk                (_U_(0x1) << SPW_TCH_IM_EARLYWD_Pos)                 /**< (SPW_TCH_IM) Early Watchdog Mask */
#define SPW_TCH_IM_EARLYWD(value)             (SPW_TCH_IM_EARLYWD_Msk & ((value) << SPW_TCH_IM_EARLYWD_Pos))
#define SPW_TCH_IM_Msk                        _U_(0x0000001F)                                      /**< (SPW_TCH_IM) Register Mask  */


/* -------- SPW_TCH_PI_C : (SPW Offset: 0xE94) ( /W 32) SpW Tch Clear Pending Interrupt -------- */
#define SPW_TCH_PI_C_TCEVENT_Pos              _U_(0)                                               /**< (SPW_TCH_PI_C) TcEvent Position */
#define SPW_TCH_PI_C_TCEVENT_Msk              (_U_(0x1) << SPW_TCH_PI_C_TCEVENT_Pos)               /**< (SPW_TCH_PI_C) TcEvent Mask */
#define SPW_TCH_PI_C_TCEVENT(value)           (SPW_TCH_PI_C_TCEVENT_Msk & ((value) << SPW_TCH_PI_C_TCEVENT_Pos))
#define SPW_TCH_PI_C_TIMECODE_Pos             _U_(1)                                               /**< (SPW_TCH_PI_C) Time Code Position */
#define SPW_TCH_PI_C_TIMECODE_Msk             (_U_(0x1) << SPW_TCH_PI_C_TIMECODE_Pos)              /**< (SPW_TCH_PI_C) Time Code Mask */
#define SPW_TCH_PI_C_TIMECODE(value)          (SPW_TCH_PI_C_TIMECODE_Msk & ((value) << SPW_TCH_PI_C_TIMECODE_Pos))
#define SPW_TCH_PI_C_ANYTIMECODE_Pos          _U_(2)                                               /**< (SPW_TCH_PI_C) Any Time Code Position */
#define SPW_TCH_PI_C_ANYTIMECODE_Msk          (_U_(0x1) << SPW_TCH_PI_C_ANYTIMECODE_Pos)           /**< (SPW_TCH_PI_C) Any Time Code Mask */
#define SPW_TCH_PI_C_ANYTIMECODE(value)       (SPW_TCH_PI_C_ANYTIMECODE_Msk & ((value) << SPW_TCH_PI_C_ANYTIMECODE_Pos))
#define SPW_TCH_PI_C_LATEWD_Pos               _U_(3)                                               /**< (SPW_TCH_PI_C) Late Watchdog Position */
#define SPW_TCH_PI_C_LATEWD_Msk               (_U_(0x1) << SPW_TCH_PI_C_LATEWD_Pos)                /**< (SPW_TCH_PI_C) Late Watchdog Mask */
#define SPW_TCH_PI_C_LATEWD(value)            (SPW_TCH_PI_C_LATEWD_Msk & ((value) << SPW_TCH_PI_C_LATEWD_Pos))
#define SPW_TCH_PI_C_EARLYWD_Pos              _U_(4)                                               /**< (SPW_TCH_PI_C) Early Watchdog Position */
#define SPW_TCH_PI_C_EARLYWD_Msk              (_U_(0x1) << SPW_TCH_PI_C_EARLYWD_Pos)               /**< (SPW_TCH_PI_C) Early Watchdog Mask */
#define SPW_TCH_PI_C_EARLYWD(value)           (SPW_TCH_PI_C_EARLYWD_Msk & ((value) << SPW_TCH_PI_C_EARLYWD_Pos))
#define SPW_TCH_PI_C_Msk                      _U_(0x0000001F)                                      /**< (SPW_TCH_PI_C) Register Mask  */


/* -------- SPW_TCH_IM_S : (SPW Offset: 0xE98) ( /W 32) SpW Tch Interrupt Set Mask -------- */
#define SPW_TCH_IM_S_TCEVENT_Pos              _U_(0)                                               /**< (SPW_TCH_IM_S) TcEvent Position */
#define SPW_TCH_IM_S_TCEVENT_Msk              (_U_(0x1) << SPW_TCH_IM_S_TCEVENT_Pos)               /**< (SPW_TCH_IM_S) TcEvent Mask */
#define SPW_TCH_IM_S_TCEVENT(value)           (SPW_TCH_IM_S_TCEVENT_Msk & ((value) << SPW_TCH_IM_S_TCEVENT_Pos))
#define SPW_TCH_IM_S_TIMECODE_Pos             _U_(1)                                               /**< (SPW_TCH_IM_S) Time Code Position */
#define SPW_TCH_IM_S_TIMECODE_Msk             (_U_(0x1) << SPW_TCH_IM_S_TIMECODE_Pos)              /**< (SPW_TCH_IM_S) Time Code Mask */
#define SPW_TCH_IM_S_TIMECODE(value)          (SPW_TCH_IM_S_TIMECODE_Msk & ((value) << SPW_TCH_IM_S_TIMECODE_Pos))
#define SPW_TCH_IM_S_ANYTIMECODE_Pos          _U_(2)                                               /**< (SPW_TCH_IM_S) Any Time Code Position */
#define SPW_TCH_IM_S_ANYTIMECODE_Msk          (_U_(0x1) << SPW_TCH_IM_S_ANYTIMECODE_Pos)           /**< (SPW_TCH_IM_S) Any Time Code Mask */
#define SPW_TCH_IM_S_ANYTIMECODE(value)       (SPW_TCH_IM_S_ANYTIMECODE_Msk & ((value) << SPW_TCH_IM_S_ANYTIMECODE_Pos))
#define SPW_TCH_IM_S_LATEWD_Pos               _U_(3)                                               /**< (SPW_TCH_IM_S) Late Watchdog Position */
#define SPW_TCH_IM_S_LATEWD_Msk               (_U_(0x1) << SPW_TCH_IM_S_LATEWD_Pos)                /**< (SPW_TCH_IM_S) Late Watchdog Mask */
#define SPW_TCH_IM_S_LATEWD(value)            (SPW_TCH_IM_S_LATEWD_Msk & ((value) << SPW_TCH_IM_S_LATEWD_Pos))
#define SPW_TCH_IM_S_EARLYWD_Pos              _U_(4)                                               /**< (SPW_TCH_IM_S) Early Watchdog Position */
#define SPW_TCH_IM_S_EARLYWD_Msk              (_U_(0x1) << SPW_TCH_IM_S_EARLYWD_Pos)               /**< (SPW_TCH_IM_S) Early Watchdog Mask */
#define SPW_TCH_IM_S_EARLYWD(value)           (SPW_TCH_IM_S_EARLYWD_Msk & ((value) << SPW_TCH_IM_S_EARLYWD_Pos))
#define SPW_TCH_IM_S_Msk                      _U_(0x0000001F)                                      /**< (SPW_TCH_IM_S) Register Mask  */


