Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/spw.h
/* -------- SPW_TCH_IM_C : (SPW Offset: 0xE9C) ( /W 32) SpW Tch Interrupt Clear Mask -------- */
#define SPW_TCH_IM_C_TCEVENT_Pos              _U_(0)                                               /**< (SPW_TCH_IM_C) TcEvent Position */
#define SPW_TCH_IM_C_TCEVENT_Msk              (_U_(0x1) << SPW_TCH_IM_C_TCEVENT_Pos)               /**< (SPW_TCH_IM_C) TcEvent Mask */
#define SPW_TCH_IM_C_TCEVENT(value)           (SPW_TCH_IM_C_TCEVENT_Msk & ((value) << SPW_TCH_IM_C_TCEVENT_Pos))
#define SPW_TCH_IM_C_TIMECODE_Pos             _U_(1)                                               /**< (SPW_TCH_IM_C) Time Code Position */
#define SPW_TCH_IM_C_TIMECODE_Msk             (_U_(0x1) << SPW_TCH_IM_C_TIMECODE_Pos)              /**< (SPW_TCH_IM_C) Time Code Mask */
#define SPW_TCH_IM_C_TIMECODE(value)          (SPW_TCH_IM_C_TIMECODE_Msk & ((value) << SPW_TCH_IM_C_TIMECODE_Pos))
#define SPW_TCH_IM_C_ANYTIMECODE_Pos          _U_(2)                                               /**< (SPW_TCH_IM_C) Any Time Code Position */
#define SPW_TCH_IM_C_ANYTIMECODE_Msk          (_U_(0x1) << SPW_TCH_IM_C_ANYTIMECODE_Pos)           /**< (SPW_TCH_IM_C) Any Time Code Mask */
#define SPW_TCH_IM_C_ANYTIMECODE(value)       (SPW_TCH_IM_C_ANYTIMECODE_Msk & ((value) << SPW_TCH_IM_C_ANYTIMECODE_Pos))
#define SPW_TCH_IM_C_LATEWD_Pos               _U_(3)                                               /**< (SPW_TCH_IM_C) Late Watchdog Position */
#define SPW_TCH_IM_C_LATEWD_Msk               (_U_(0x1) << SPW_TCH_IM_C_LATEWD_Pos)                /**< (SPW_TCH_IM_C) Late Watchdog Mask */
#define SPW_TCH_IM_C_LATEWD(value)            (SPW_TCH_IM_C_LATEWD_Msk & ((value) << SPW_TCH_IM_C_LATEWD_Pos))
#define SPW_TCH_IM_C_EARLYWD_Pos              _U_(4)                                               /**< (SPW_TCH_IM_C) Early Watchdog Position */
#define SPW_TCH_IM_C_EARLYWD_Msk              (_U_(0x1) << SPW_TCH_IM_C_EARLYWD_Pos)               /**< (SPW_TCH_IM_C) Early Watchdog Mask */
#define SPW_TCH_IM_C_EARLYWD(value)           (SPW_TCH_IM_C_EARLYWD_Msk & ((value) << SPW_TCH_IM_C_EARLYWD_Pos))
#define SPW_TCH_IM_C_Msk                      _U_(0x0000001F)                                      /**< (SPW_TCH_IM_C) Register Mask  */


/* -------- SPW_TCH_CFGLISTEN : (SPW Offset: 0xEA0) (R/W 32) SpW Tch Config Listener -------- */
#define SPW_TCH_CFGLISTEN_L1_Pos              _U_(0)                                               /**< (SPW_TCH_CFGLISTEN) Listen  link 1 Position */
#define SPW_TCH_CFGLISTEN_L1_Msk              (_U_(0x1) << SPW_TCH_CFGLISTEN_L1_Pos)               /**< (SPW_TCH_CFGLISTEN) Listen  link 1 Mask */
#define SPW_TCH_CFGLISTEN_L1(value)           (SPW_TCH_CFGLISTEN_L1_Msk & ((value) << SPW_TCH_CFGLISTEN_L1_Pos))
#define SPW_TCH_CFGLISTEN_L2_Pos              _U_(1)                                               /**< (SPW_TCH_CFGLISTEN) Listen link 2 Position */
#define SPW_TCH_CFGLISTEN_L2_Msk              (_U_(0x1) << SPW_TCH_CFGLISTEN_L2_Pos)               /**< (SPW_TCH_CFGLISTEN) Listen link 2 Mask */
#define SPW_TCH_CFGLISTEN_L2(value)           (SPW_TCH_CFGLISTEN_L2_Msk & ((value) << SPW_TCH_CFGLISTEN_L2_Pos))
#define SPW_TCH_CFGLISTEN_Msk                 _U_(0x00000003)                                      /**< (SPW_TCH_CFGLISTEN) Register Mask  */

#define SPW_TCH_CFGLISTEN_L_Pos               _U_(0)                                               /**< (SPW_TCH_CFGLISTEN Position) Listen link 2 */
#define SPW_TCH_CFGLISTEN_L_Msk               (_U_(0x3) << SPW_TCH_CFGLISTEN_L_Pos)                /**< (SPW_TCH_CFGLISTEN Mask) L */
#define SPW_TCH_CFGLISTEN_L(value)            (SPW_TCH_CFGLISTEN_L_Msk & ((value) << SPW_TCH_CFGLISTEN_L_Pos)) 

/* -------- SPW_TCH_CFGSEND : (SPW Offset: 0xEA4) (R/W 32) SpW Tch Config Sender -------- */
#define SPW_TCH_CFGSEND_S1_Pos                _U_(0)                                               /**< (SPW_TCH_CFGSEND) Send link 1 Position */
#define SPW_TCH_CFGSEND_S1_Msk                (_U_(0x1) << SPW_TCH_CFGSEND_S1_Pos)                 /**< (SPW_TCH_CFGSEND) Send link 1 Mask */
#define SPW_TCH_CFGSEND_S1(value)             (SPW_TCH_CFGSEND_S1_Msk & ((value) << SPW_TCH_CFGSEND_S1_Pos))
#define SPW_TCH_CFGSEND_S2_Pos                _U_(1)                                               /**< (SPW_TCH_CFGSEND) Send link 2 Position */
#define SPW_TCH_CFGSEND_S2_Msk                (_U_(0x1) << SPW_TCH_CFGSEND_S2_Pos)                 /**< (SPW_TCH_CFGSEND) Send link 2 Mask */
#define SPW_TCH_CFGSEND_S2(value)             (SPW_TCH_CFGSEND_S2_Msk & ((value) << SPW_TCH_CFGSEND_S2_Pos))
#define SPW_TCH_CFGSEND_Msk                   _U_(0x00000003)                                      /**< (SPW_TCH_CFGSEND) Register Mask  */

#define SPW_TCH_CFGSEND_S_Pos                 _U_(0)                                               /**< (SPW_TCH_CFGSEND Position) Send link 2 */
#define SPW_TCH_CFGSEND_S_Msk                 (_U_(0x3) << SPW_TCH_CFGSEND_S_Pos)                  /**< (SPW_TCH_CFGSEND Mask) S */
#define SPW_TCH_CFGSEND_S(value)              (SPW_TCH_CFGSEND_S_Msk & ((value) << SPW_TCH_CFGSEND_S_Pos)) 

/* -------- SPW_TCH_CFG : (SPW Offset: 0xEA8) (R/W 32) SpW Tch Config -------- */
#define SPW_TCH_CFG_EVENT_Pos                 _U_(0)                                               /**< (SPW_TCH_CFG) Event Position */
#define SPW_TCH_CFG_EVENT_Msk                 (_U_(0x3F) << SPW_TCH_CFG_EVENT_Pos)                 /**< (SPW_TCH_CFG) Event Mask */
#define SPW_TCH_CFG_EVENT(value)              (SPW_TCH_CFG_EVENT_Msk & ((value) << SPW_TCH_CFG_EVENT_Pos))
#define SPW_TCH_CFG_Msk                       _U_(0x0000003F)                                      /**< (SPW_TCH_CFG) Register Mask  */


/* -------- SPW_TCH_CFGRESTART : (SPW Offset: 0xEAC) (R/W 32) SpW Tch Config Restart -------- */
#define SPW_TCH_CFGRESTART_VALUE_Pos          _U_(0)                                               /**< (SPW_TCH_CFGRESTART) Value Position */
#define SPW_TCH_CFGRESTART_VALUE_Msk          (_U_(0x3F) << SPW_TCH_CFGRESTART_VALUE_Pos)          /**< (SPW_TCH_CFGRESTART) Value Mask */
#define SPW_TCH_CFGRESTART_VALUE(value)       (SPW_TCH_CFGRESTART_VALUE_Msk & ((value) << SPW_TCH_CFGRESTART_VALUE_Pos))
#define SPW_TCH_CFGRESTART_EVENT_Pos          _U_(8)                                               /**< (SPW_TCH_CFGRESTART) Event Position */
#define SPW_TCH_CFGRESTART_EVENT_Msk          (_U_(0x3F) << SPW_TCH_CFGRESTART_EVENT_Pos)          /**< (SPW_TCH_CFGRESTART) Event Mask */
#define SPW_TCH_CFGRESTART_EVENT(value)       (SPW_TCH_CFGRESTART_EVENT_Msk & ((value) << SPW_TCH_CFGRESTART_EVENT_Pos))
#define SPW_TCH_CFGRESTART_PPS_Pos            _U_(14)                                              /**< (SPW_TCH_CFGRESTART) Pps Position */
#define SPW_TCH_CFGRESTART_PPS_Msk            (_U_(0x1) << SPW_TCH_CFGRESTART_PPS_Pos)             /**< (SPW_TCH_CFGRESTART) Pps Mask */
#define SPW_TCH_CFGRESTART_PPS(value)         (SPW_TCH_CFGRESTART_PPS_Msk & ((value) << SPW_TCH_CFGRESTART_PPS_Pos))
#define SPW_TCH_CFGRESTART_ONESHOT_Pos        _U_(15)                                              /**< (SPW_TCH_CFGRESTART) One Shot Position */
#define SPW_TCH_CFGRESTART_ONESHOT_Msk        (_U_(0x1) << SPW_TCH_CFGRESTART_ONESHOT_Pos)         /**< (SPW_TCH_CFGRESTART) One Shot Mask */
#define SPW_TCH_CFGRESTART_ONESHOT(value)     (SPW_TCH_CFGRESTART_ONESHOT_Msk & ((value) << SPW_TCH_CFGRESTART_ONESHOT_Pos))
#define SPW_TCH_CFGRESTART_Msk                _U_(0x0000FF3F)                                      /**< (SPW_TCH_CFGRESTART) Register Mask  */


