Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/spw.h
/** \brief SPW register offsets definitions */
#define SPW_ROUTER_STS_REG_OFST        (0x00)              /**< (SPW_ROUTER_STS) SpW Router Status Offset */
#define SPW_ROUTER_CFG_REG_OFST        (0x04)              /**< (SPW_ROUTER_CFG) SpW Router Config Offset */
#define SPW_ROUTER_TIMEOUT_REG_OFST    (0x08)              /**< (SPW_ROUTER_TIMEOUT) SpW Router Timeout Offset */
#define SPW_ROUTER_TABLE_REG_OFST      (0x80)              /**< (SPW_ROUTER_TABLE) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_LINK1_PI_RM_REG_OFST       (0x400)             /**< (SPW_LINK1_PI_RM) SpW Link 1 Pending Read Masked Interrupt Offset */
#define SPW_LINK1_PI_RCM_REG_OFST      (0x404)             /**< (SPW_LINK1_PI_RCM) SpW Link 1 Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK1_PI_R_REG_OFST        (0x408)             /**< (SPW_LINK1_PI_R) SpW Link 1 Pending Read Interrupt Offset */
#define SPW_LINK1_PI_RCS_REG_OFST      (0x40C)             /**< (SPW_LINK1_PI_RCS) SpW Link 1 Pending Read, Clear and Enabed Interrupt Offset */
#define SPW_LINK1_IM_REG_OFST          (0x410)             /**< (SPW_LINK1_IM) SpW Link 1 Interrupt Mask Offset */
#define SPW_LINK1_PI_C_REG_OFST        (0x414)             /**< (SPW_LINK1_PI_C) SpW Link 1 Clear Pending Interrupt Offset */
#define SPW_LINK1_IM_S_REG_OFST        (0x418)             /**< (SPW_LINK1_IM_S) SpW Link 1 Interrupt Set Mask Offset */
#define SPW_LINK1_IM_C_REG_OFST        (0x41C)             /**< (SPW_LINK1_IM_C) SpW Link 1 Interrupt Clear Mask Offset */
#define SPW_LINK1_CFG_REG_OFST         (0x420)             /**< (SPW_LINK1_CFG) SpW Link 1 Config Offset */
#define SPW_LINK1_CLKDIV_REG_OFST      (0x424)             /**< (SPW_LINK1_CLKDIV) SpW Link 1 Clock Division Offset */
#define SPW_LINK1_STATUS_REG_OFST      (0x428)             /**< (SPW_LINK1_STATUS) SpW Link 1 Status Offset */
#define SPW_LINK1_SWRESET_REG_OFST     (0x42C)             /**< (SPW_LINK1_SWRESET) SpW Link 1 Software Reset Offset */
#define SPW_LINK1_ESCCHAREVENT0_REG_OFST (0x430)             /**< (SPW_LINK1_ESCCHAREVENT0) SpW Link 1 Escape Character Event 0 Offset */
#define SPW_LINK1_ESCCHAREVENT1_REG_OFST (0x434)             /**< (SPW_LINK1_ESCCHAREVENT1) SpW Link 1 Escape Character Event 1 Offset */
#define SPW_LINK1_ESCCHARSTS_REG_OFST  (0x438)             /**< (SPW_LINK1_ESCCHARSTS) SpW Link 1 Escape Character Status Offset */
#define SPW_LINK1_TRANSESC_REG_OFST    (0x43C)             /**< (SPW_LINK1_TRANSESC) SpW Link 1 Transmit Escape Character Offset */
#define SPW_LINK1_DISTINTPI_RM_REG_OFST (0x440)             /**< (SPW_LINK1_DISTINTPI_RM) SpW Link 1 Distributed Interrupt Pending Read Masked Interrupt Offset */
#define SPW_LINK1_DISTINTPI_RCM_REG_OFST (0x444)             /**< (SPW_LINK1_DISTINTPI_RCM) SpW Link 1 Distributed Interrupt Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK1_DISTINTPI_R_REG_OFST (0x448)             /**< (SPW_LINK1_DISTINTPI_R) SpW Link 1 Distributed Interrupt Pending Read Interrupt Offset */
#define SPW_LINK1_DISTINTPI_RCS_REG_OFST (0x44C)             /**< (SPW_LINK1_DISTINTPI_RCS) SpW Link 1 Distributed Interrupt Pending Read and Clear Interrupt Offset */
#define SPW_LINK1_DISTINTIM_REG_OFST   (0x450)             /**< (SPW_LINK1_DISTINTIM) SpW Link 1 Distributed Interrupt Mask Offset */
#define SPW_LINK1_DISTINTPI_C_REG_OFST (0x454)             /**< (SPW_LINK1_DISTINTPI_C) SpW Link 1 Distributed Interrupt Clear Pending Interrupt Offset */
#define SPW_LINK1_DISTINTIM_S_REG_OFST (0x458)             /**< (SPW_LINK1_DISTINTIM_S) SpW Link 1 Distributed Interrupt Set Mask Offset */
#define SPW_LINK1_DISTINTIM_C_REG_OFST (0x45C)             /**< (SPW_LINK1_DISTINTIM_C) SpW Link 1 Distributed Interrupt Clear Mask Offset */
#define SPW_LINK1_DISTACKPI_RM_REG_OFST (0x460)             /**< (SPW_LINK1_DISTACKPI_RM) SpW Link 1 Distributed Interrupt Acknowledge Pending Read Masked Interrupt Offset */
#define SPW_LINK1_DISTACKPI_RCM_REG_OFST (0x464)             /**< (SPW_LINK1_DISTACKPI_RCM) SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK1_DISTACKPI_R_REG_OFST (0x468)             /**< (SPW_LINK1_DISTACKPI_R) SpW Link 1 Distributed Interrupt Acknowledge Pending Read Interrupt Offset */
#define SPW_LINK1_DISTACKPI_RCS_REG_OFST (0x46C)             /**< (SPW_LINK1_DISTACKPI_RCS) SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Interrupt Offset */
#define SPW_LINK1_DISTACKIM_REG_OFST   (0x470)             /**< (SPW_LINK1_DISTACKIM) SpW Link 1 Distributed Interrupt Acknowledge Mask Offset */
#define SPW_LINK1_DISTACKPI_C_REG_OFST (0x474)             /**< (SPW_LINK1_DISTACKPI_C) SpW Link 1 Distributed Interrupt Acknowledge Clear Pending Interrupt Offset */
#define SPW_LINK1_DISTACKIM_S_REG_OFST (0x478)             /**< (SPW_LINK1_DISTACKIM_S) SpW Link 1 Distributed Interrupt Acknowledge Set Mask Offset */
#define SPW_LINK1_DISTACKIM_C_REG_OFST (0x47C)             /**< (SPW_LINK1_DISTACKIM_C) SpW Link 1 Distributed Interrupt Acknowledge Clear Mask Offset */
#define SPW_LINK2_PI_RM_REG_OFST       (0x480)             /**< (SPW_LINK2_PI_RM) SpW Link 2 Pending Read Masked Interrupt Offset */
#define SPW_LINK2_PI_RCM_REG_OFST      (0x484)             /**< (SPW_LINK2_PI_RCM) SpW Link 2 Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK2_PI_R_REG_OFST        (0x488)             /**< (SPW_LINK2_PI_R) SpW Link 2 Pending Read Interrupt Offset */
#define SPW_LINK2_PI_RCS_REG_OFST      (0x48C)             /**< (SPW_LINK2_PI_RCS) SpW Link 2 Pending Read, Clear and Enabled Interrupt Offset */
#define SPW_LINK2_IM_REG_OFST          (0x490)             /**< (SPW_LINK2_IM) SpW Link 2 Interrupt Mask Offset */
#define SPW_LINK2_PI_C_REG_OFST        (0x494)             /**< (SPW_LINK2_PI_C) SpW Link 2 Clear Pending Interrupt Offset */
#define SPW_LINK2_IM_S_REG_OFST        (0x498)             /**< (SPW_LINK2_IM_S) SpW Link 2 Interrupt Set Mask Offset */
#define SPW_LINK2_IM_C_REG_OFST        (0x49C)             /**< (SPW_LINK2_IM_C) SpW Link 2 Interrupt Clear Mask Offset */
#define SPW_LINK2_CFG_REG_OFST         (0x4A0)             /**< (SPW_LINK2_CFG) SpW Link 2 Config Offset */
#define SPW_LINK2_CLKDIV_REG_OFST      (0x4A4)             /**< (SPW_LINK2_CLKDIV) SpW Link 2 Clock Division Offset */
#define SPW_LINK2_STATUS_REG_OFST      (0x4A8)             /**< (SPW_LINK2_STATUS) SpW Link 2 Status Offset */
#define SPW_LINK2_SWRESET_REG_OFST     (0x4AC)             /**< (SPW_LINK2_SWRESET) SpW Link 2 Software Reset Offset */
#define SPW_LINK2_ESCCHAREVENT0_REG_OFST (0x4B0)             /**< (SPW_LINK2_ESCCHAREVENT0) SpW Link 2 Escape Character Event 0 Offset */
#define SPW_LINK2_ESCCHAREVENT1_REG_OFST (0x4B4)             /**< (SPW_LINK2_ESCCHAREVENT1) SpW Link 2 Escape Character Event 1 Offset */
#define SPW_LINK2_ESCCHARSTS_REG_OFST  (0x4B8)             /**< (SPW_LINK2_ESCCHARSTS) SpW Link 2 Escape Character Status Offset */
#define SPW_LINK2_TRANSESC_REG_OFST    (0x4BC)             /**< (SPW_LINK2_TRANSESC) SpW Link 2 Transmit Escape Character Offset */
#define SPW_LINK2_DISTINTPI_RM_REG_OFST (0x4C0)             /**< (SPW_LINK2_DISTINTPI_RM) SpW Link 2 Distributed Interrupt Pending Read Masked Interrupt Offset */
#define SPW_LINK2_DISTINTPI_RCM_REG_OFST (0x4C4)             /**< (SPW_LINK2_DISTINTPI_RCM) SpW Link 2 Distributed Interrupt Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK2_DISTINTPI_R_REG_OFST (0x4C8)             /**< (SPW_LINK2_DISTINTPI_R) SpW Link 2 Distributed Interrupt Pending Read Interrupt Offset */
#define SPW_LINK2_DISTINTPI_RCS_REG_OFST (0x4CC)             /**< (SPW_LINK2_DISTINTPI_RCS) SpW Link 2 Distributed Interrupt Pending Read and Clear Interrupt Offset */
#define SPW_LINK2_DISTINTIM_REG_OFST   (0x4D0)             /**< (SPW_LINK2_DISTINTIM) SpW Link 2 Distributed Interrupt Mask Offset */
#define SPW_LINK2_DISTINTPI_C_REG_OFST (0x4D4)             /**< (SPW_LINK2_DISTINTPI_C) SpW Link 2 Distributed Interrupt Clear Pending Interrupt Offset */
#define SPW_LINK2_DISTINTIM_S_REG_OFST (0x4D8)             /**< (SPW_LINK2_DISTINTIM_S) SpW Link 2 Distributed Interrupt Set Mask Offset */
#define SPW_LINK2_DISTINTIM_C_REG_OFST (0x4DC)             /**< (SPW_LINK2_DISTINTIM_C) SpW Link 2 Distributed Interrupt Clear Mask Offset */
#define SPW_LINK2_DISTACKPI_RM_REG_OFST (0x4E0)             /**< (SPW_LINK2_DISTACKPI_RM) SpW Link 2 Distributed Interrupt Acknowledge Pending Read Masked Interrupt Offset */
#define SPW_LINK2_DISTACKPI_RCM_REG_OFST (0x4E4)             /**< (SPW_LINK2_DISTACKPI_RCM) SpW Link 2 Distributed Interrupt Acknowledge Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK2_DISTACKPI_R_REG_OFST (0x4E8)             /**< (SPW_LINK2_DISTACKPI_R) SpW Link 2 Distributed Interrupt Acknowledge Pending Read Interrupt Offset */
#define SPW_LINK2_DISTACKPI_RCS_REG_OFST (0x4EC)             /**< (SPW_LINK2_DISTACKPI_RCS) SpW Link 2 Distributed Interrupt Acknowledge Pending Read and Clear Interrupt Offset */
#define SPW_LINK2_DISTACKIM_REG_OFST   (0x4F0)             /**< (SPW_LINK2_DISTACKIM) SpW Link 2 Distributed Interrupt Acknowledge Mask Offset */
#define SPW_LINK2_DISTACKPI_C_REG_OFST (0x4F4)             /**< (SPW_LINK2_DISTACKPI_C) SpW Link 2 Distributed Interrupt Acknowledge Clear Pending Interrupt Offset */
#define SPW_LINK2_DISTACKIM_S_REG_OFST (0x4F8)             /**< (SPW_LINK2_DISTACKIM_S) SpW Link 2 Distributed Interrupt Acknowledge Set Mask Offset */
#define SPW_LINK2_DISTACKIM_C_REG_OFST (0x4FC)             /**< (SPW_LINK2_DISTACKIM_C) SpW Link 2 Distributed Interrupt Acknowledge Clear Mask Offset */
#define SPW_PKTRX1_PI_RM_REG_OFST      (0x800)             /**< (SPW_PKTRX1_PI_RM) PktRx Pending Read Masked Interrupt Offset */
#define SPW_PKTRX1_PI_RCM_REG_OFST     (0x804)             /**< (SPW_PKTRX1_PI_RCM) PktRx Pending Read and Clear Masked Interrupt Offset */
#define SPW_PKTRX1_PI_R_REG_OFST       (0x808)             /**< (SPW_PKTRX1_PI_R) PktRx Pending Read Interrupt Offset */
#define SPW_PKTRX1_PI_RCS_REG_OFST     (0x80C)             /**< (SPW_PKTRX1_PI_RCS) PktRx Pending Read, Clear and Enabled Interrupt Offset */
#define SPW_PKTRX1_IM_REG_OFST         (0x810)             /**< (SPW_PKTRX1_IM) PktRx Interrupt Mask Offset */
#define SPW_PKTRX1_PI_C_REG_OFST       (0x814)             /**< (SPW_PKTRX1_PI_C) PktRx Clear Pending Interrupt Offset */
#define SPW_PKTRX1_IM_S_REG_OFST       (0x818)             /**< (SPW_PKTRX1_IM_S) PktRx Interrupt Set Mask Offset */
#define SPW_PKTRX1_IM_C_REG_OFST       (0x81C)             /**< (SPW_PKTRX1_IM_C) PktRx Interrupt Clear Mask Offset */
#define SPW_PKTRX1_CFG_REG_OFST        (0x820)             /**< (SPW_PKTRX1_CFG) PktRx Config Offset */
#define SPW_PKTRX1_STATUS_REG_OFST     (0x824)             /**< (SPW_PKTRX1_STATUS) PktRx Status Offset */
#define SPW_PKTRX1_NXTBUFDATAADDR_REG_OFST (0x830)             /**< (SPW_PKTRX1_NXTBUFDATAADDR) PktRx Next Buffer Data Address Offset */
#define SPW_PKTRX1_NXTBUFDATALEN_REG_OFST (0x834)             /**< (SPW_PKTRX1_NXTBUFDATALEN) PktRx Next Buffer Data Length Offset */
#define SPW_PKTRX1_NXTBUFPKTADDR_REG_OFST (0x838)             /**< (SPW_PKTRX1_NXTBUFPKTADDR) PktRx Next Buffer Packet Address Offset */
#define SPW_PKTRX1_NXTBUFCFG_REG_OFST  (0x83C)             /**< (SPW_PKTRX1_NXTBUFCFG) PktRx Next Buffer Config Offset */
#define SPW_PKTRX1_CURBUFDATAADDR_REG_OFST (0x840)             /**< (SPW_PKTRX1_CURBUFDATAADDR) PktRx Current Buffer Data Address Offset */
#define SPW_PKTRX1_CURBUFDATALEN_REG_OFST (0x844)             /**< (SPW_PKTRX1_CURBUFDATALEN) PktRx Current Buffer Data Length Offset */
#define SPW_PKTRX1_CURBUFPKTADDR_REG_OFST (0x848)             /**< (SPW_PKTRX1_CURBUFPKTADDR) PktRx Current Buffer Packet Address Offset */
#define SPW_PKTRX1_CURBUFCFG_REG_OFST  (0x84C)             /**< (SPW_PKTRX1_CURBUFCFG) PktRx Current Buffer Config Offset */
#define SPW_PKTRX1_PREVBUFDATALEN_REG_OFST (0x850)             /**< (SPW_PKTRX1_PREVBUFDATALEN) PktRx Previous Buffer Data Length Offset */
#define SPW_PKTRX1_PREVBUFSTS_REG_OFST (0x854)             /**< (SPW_PKTRX1_PREVBUFSTS) PktRx Previous Buffer Status Offset */
#define SPW_PKTRX1_SWRESET_REG_OFST    (0x87C)             /**< (SPW_PKTRX1_SWRESET) PktRx Software Reset Offset */
#define SPW_PKTTX1_PI_RM_REG_OFST      (0xC00)             /**< (SPW_PKTTX1_PI_RM) PktTx Pending Read Masked Interrupt Offset */
#define SPW_PKTTX1_PI_RCM_REG_OFST     (0xC04)             /**< (SPW_PKTTX1_PI_RCM) PktTx Pending Read and Clear Masked Interrupt Offset */
#define SPW_PKTTX1_PI_R_REG_OFST       (0xC08)             /**< (SPW_PKTTX1_PI_R) PktTx Pending Read Interrupt Offset */
#define SPW_PKTTX1_PI_RCS_REG_OFST     (0xC0C)             /**< (SPW_PKTTX1_PI_RCS) PktTx Pending Read, Clear and Enabled Interrupt Offset */
#define SPW_PKTTX1_IM_REG_OFST         (0xC10)             /**< (SPW_PKTTX1_IM) PktTx Interrupt Mask Offset */
#define SPW_PKTTX1_PI_C_REG_OFST       (0xC14)             /**< (SPW_PKTTX1_PI_C) PktTx Clear Pending Interrupt Offset */
#define SPW_PKTTX1_IM_S_REG_OFST       (0xC18)             /**< (SPW_PKTTX1_IM_S) PktTx Interrupt Set Mask Offset */
#define SPW_PKTTX1_IM_C_REG_OFST       (0xC1C)             /**< (SPW_PKTTX1_IM_C) PktTx Interrupt Clear Mask Offset */
#define SPW_PKTTX1_STATUS_REG_OFST     (0xC20)             /**< (SPW_PKTTX1_STATUS) PktTx Status Offset */
#define SPW_PKTTX1_NXTSENDROUT_REG_OFST (0xC24)             /**< (SPW_PKTTX1_NXTSENDROUT) PktTx Next Send List Router Bytes Offset */
#define SPW_PKTTX1_NXTSENDADDR_REG_OFST (0xC28)             /**< (SPW_PKTTX1_NXTSENDADDR) PktTx Next Send List Address Offset */
#define SPW_PKTTX1_NXTSENDCFG_REG_OFST (0xC2C)             /**< (SPW_PKTTX1_NXTSENDCFG) PktTx Next Send List Config Offset */
#define SPW_PKTTX1_CURSENDROUT_REG_OFST (0xC30)             /**< (SPW_PKTTX1_CURSENDROUT) PktTx Current Send List Router Bytes Offset */
#define SPW_PKTTX1_CURSENDADDR_REG_OFST (0xC34)             /**< (SPW_PKTTX1_CURSENDADDR) PktTx Current Send List Address Offset */
#define SPW_PKTTX1_CURSENDCFG_REG_OFST (0xC38)             /**< (SPW_PKTTX1_CURSENDCFG) PktTx Current Send List Config Offset */
#define SPW_PKTTX1_SWRESET_REG_OFST    (0xC3C)             /**< (SPW_PKTTX1_SWRESET) PktTx Software Reset Offset */
#define SPW_RMAP1_CFG_REG_OFST         (0xE00)             /**< (SPW_RMAP1_CFG) SpW RMAP 1 Config Offset */
#define SPW_RMAP1_STS_RC_REG_OFST      (0xE04)             /**< (SPW_RMAP1_STS_RC) SpW RMAP 1 Read and Clear Status Offset */
#define SPW_RMAP1_STS_REG_OFST         (0xE08)             /**< (SPW_RMAP1_STS) SpW RMAP 1 Read Status Offset */
#define SPW_TCH_PI_RM_REG_OFST         (0xE80)             /**< (SPW_TCH_PI_RM) SpW Tch Pending Read Masked Interrupt Offset */
#define SPW_TCH_PI_RCM_REG_OFST        (0xE84)             /**< (SPW_TCH_PI_RCM) SpW Tch Pending Read and Clear Masked Interrupt Offset */
#define SPW_TCH_PI_R_REG_OFST          (0xE88)             /**< (SPW_TCH_PI_R) SpW Tch Pending Read Interrupt Offset */
#define SPW_TCH_PI_RCS_REG_OFST        (0xE8C)             /**< (SPW_TCH_PI_RCS) SpW Tch Pending Read, Clear and Enabled Interrupt Offset */
#define SPW_TCH_IM_REG_OFST            (0xE90)             /**< (SPW_TCH_IM) SpW Tch Interrupt Mask Offset */
#define SPW_TCH_PI_C_REG_OFST          (0xE94)             /**< (SPW_TCH_PI_C) SpW Tch Clear Pending Interrupt Offset */
#define SPW_TCH_IM_S_REG_OFST          (0xE98)             /**< (SPW_TCH_IM_S) SpW Tch Interrupt Set Mask Offset */
#define SPW_TCH_IM_C_REG_OFST          (0xE9C)             /**< (SPW_TCH_IM_C) SpW Tch Interrupt Clear Mask Offset */
#define SPW_TCH_CFGLISTEN_REG_OFST     (0xEA0)             /**< (SPW_TCH_CFGLISTEN) SpW Tch Config Listener Offset */
#define SPW_TCH_CFGSEND_REG_OFST       (0xEA4)             /**< (SPW_TCH_CFGSEND) SpW Tch Config Sender Offset */
#define SPW_TCH_CFG_REG_OFST           (0xEA8)             /**< (SPW_TCH_CFG) SpW Tch Config Offset */
#define SPW_TCH_CFGRESTART_REG_OFST    (0xEAC)             /**< (SPW_TCH_CFGRESTART) SpW Tch Config Restart Offset */
#define SPW_TCH_CFGTCEVENT_REG_OFST    (0xEB0)             /**< (SPW_TCH_CFGTCEVENT) SpW Tch Config Tc Event Offset */
#define SPW_TCH_CFGWD_REG_OFST         (0xEB4)             /**< (SPW_TCH_CFGWD) SpW Tch Config Watchdog Offset */
#define SPW_TCH_LASTTIMECODE_REG_OFST  (0xEB8)             /**< (SPW_TCH_LASTTIMECODE) SpW Tch Last Time Code Offset */
#define SPW_TCH_SWRESET_REG_OFST       (0xEBC)             /**< (SPW_TCH_SWRESET) SpW Tch Software Reset Offset */
#define SPW_GROUP_IRQSTS1_REG_OFST     (0xF00)             /**< (SPW_GROUP_IRQSTS1) SpW Group Interrupt status 1 Offset */
#define SPW_GROUP_IRQSTS2_REG_OFST     (0xF04)             /**< (SPW_GROUP_IRQSTS2) SpW Group Interrupt status 2 Offset */
#define SPW_GROUP_EDACSTS_REG_OFST     (0xF08)             /**< (SPW_GROUP_EDACSTS) SpW Group Interrupt status Offset */

